espressif/esp-idf/components/soc/esp32s3/include/soc/mcpwm_reg.h
#define MCPWM_TIMER2_STATUS_REG(i)          (REG_MCPWM_BASE(i) + 0x30)
/* MCPWM_TIMER2_DIRECTION : RO ;bitpos:[16] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TIMER2_DIRECTION    (BIT(16))
#define MCPWM_TIMER2_DIRECTION_M  (BIT(16))
#define MCPWM_TIMER2_DIRECTION_V  0x1
#define MCPWM_TIMER2_DIRECTION_S  16
/* MCPWM_TIMER2_VALUE : RO ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: .*/
#define MCPWM_TIMER2_VALUE    0x0000FFFF
#define MCPWM_TIMER2_VALUE_M  ((MCPWM_TIMER2_VALUE_V)<<(MCPWM_TIMER2_VALUE_S))
#define MCPWM_TIMER2_VALUE_V  0xFFFF
#define MCPWM_TIMER2_VALUE_S  0

#define MCPWM_TIMER_SYNCI_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x34)
/* MCPWM_EXTERNAL_SYNCI2_INVERT : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_EXTERNAL_SYNCI2_INVERT    (BIT(11))
#define MCPWM_EXTERNAL_SYNCI2_INVERT_M  (BIT(11))
#define MCPWM_EXTERNAL_SYNCI2_INVERT_V  0x1
#define MCPWM_EXTERNAL_SYNCI2_INVERT_S  11
/* MCPWM_EXTERNAL_SYNCI1_INVERT : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_EXTERNAL_SYNCI1_INVERT    (BIT(10))
#define MCPWM_EXTERNAL_SYNCI1_INVERT_M  (BIT(10))
#define MCPWM_EXTERNAL_SYNCI1_INVERT_V  0x1
#define MCPWM_EXTERNAL_SYNCI1_INVERT_S  10
/* MCPWM_EXTERNAL_SYNCI0_INVERT : R/W ;bitpos:[9] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_EXTERNAL_SYNCI0_INVERT    (BIT(9))
#define MCPWM_EXTERNAL_SYNCI0_INVERT_M  (BIT(9))
#define MCPWM_EXTERNAL_SYNCI0_INVERT_V  0x1
#define MCPWM_EXTERNAL_SYNCI0_INVERT_S  9
/* MCPWM_TIMER2_SYNCISEL : R/W ;bitpos:[8:6] ;default: 3'd0 ; */
/*description: .*/
#define MCPWM_TIMER2_SYNCISEL    0x00000007
#define MCPWM_TIMER2_SYNCISEL_M  ((MCPWM_TIMER2_SYNCISEL_V)<<(MCPWM_TIMER2_SYNCISEL_S))
#define MCPWM_TIMER2_SYNCISEL_V  0x7
#define MCPWM_TIMER2_SYNCISEL_S  6
/* MCPWM_TIMER1_SYNCISEL : R/W ;bitpos:[5:3] ;default: 3'd0 ; */
/*description: .*/
#define MCPWM_TIMER1_SYNCISEL    0x00000007
#define MCPWM_TIMER1_SYNCISEL_M  ((MCPWM_TIMER1_SYNCISEL_V)<<(MCPWM_TIMER1_SYNCISEL_S))
#define MCPWM_TIMER1_SYNCISEL_V  0x7
#define MCPWM_TIMER1_SYNCISEL_S  3
/* MCPWM_TIMER0_SYNCISEL : R/W ;bitpos:[2:0] ;default: 3'd0 ; */
/*description: .*/
#define MCPWM_TIMER0_SYNCISEL    0x00000007
#define MCPWM_TIMER0_SYNCISEL_M  ((MCPWM_TIMER0_SYNCISEL_V)<<(MCPWM_TIMER0_SYNCISEL_S))
#define MCPWM_TIMER0_SYNCISEL_V  0x7
#define MCPWM_TIMER0_SYNCISEL_S  0

#define MCPWM_OPERATOR_TIMERSEL_REG(i)          (REG_MCPWM_BASE(i) + 0x38)
/* MCPWM_OPERATOR2_TIMERSEL : R/W ;bitpos:[5:4] ;default: 2'd0 ; */
/*description: 0: timer0, 1: timer1, 2: timer2.*/
#define MCPWM_OPERATOR2_TIMERSEL    0x00000003
#define MCPWM_OPERATOR2_TIMERSEL_M  ((MCPWM_OPERATOR2_TIMERSEL_V)<<(MCPWM_OPERATOR2_TIMERSEL_S))
#define MCPWM_OPERATOR2_TIMERSEL_V  0x3
#define MCPWM_OPERATOR2_TIMERSEL_S  4
/* MCPWM_OPERATOR1_TIMERSEL : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: 0: timer0, 1: timer1, 2: timer2.*/
#define MCPWM_OPERATOR1_TIMERSEL    0x00000003
#define MCPWM_OPERATOR1_TIMERSEL_M  ((MCPWM_OPERATOR1_TIMERSEL_V)<<(MCPWM_OPERATOR1_TIMERSEL_S))
#define MCPWM_OPERATOR1_TIMERSEL_V  0x3
#define MCPWM_OPERATOR1_TIMERSEL_S  2
/* MCPWM_OPERATOR0_TIMERSEL : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: 0: timer0, 1: timer1, 2: timer2.*/
#define MCPWM_OPERATOR0_TIMERSEL    0x00000003
#define MCPWM_OPERATOR0_TIMERSEL_M  ((MCPWM_OPERATOR0_TIMERSEL_V)<<(MCPWM_OPERATOR0_TIMERSEL_S))
#define MCPWM_OPERATOR0_TIMERSEL_V  0x3
#define MCPWM_OPERATOR0_TIMERSEL_S  0

#define MCPWM_CMPR0_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x3C)
/* MCPWM_CMPR0_B_SHDW_FULL : R/W ;bitpos:[9] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR0_B_SHDW_FULL    (BIT(9))
#define MCPWM_CMPR0_B_SHDW_FULL_M  (BIT(9))
#define MCPWM_CMPR0_B_SHDW_FULL_V  0x1
#define MCPWM_CMPR0_B_SHDW_FULL_S  9
/* MCPWM_CMPR0_A_SHDW_FULL : R/W ;bitpos:[8] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR0_A_SHDW_FULL    (BIT(8))
#define MCPWM_CMPR0_A_SHDW_FULL_M  (BIT(8))
#define MCPWM_CMPR0_A_SHDW_FULL_V  0x1
#define MCPWM_CMPR0_A_SHDW_FULL_S  8
/* MCPWM_CMPR0_B_UPMETHOD : R/W ;bitpos:[7:4] ;default: 4'd0 ; */
/*description: 0: immediate, bit0: tez, bit1: tep, bit2: sync, bit3: freeze.*/
#define MCPWM_CMPR0_B_UPMETHOD    0x0000000F
#define MCPWM_CMPR0_B_UPMETHOD_M  ((MCPWM_CMPR0_B_UPMETHOD_V)<<(MCPWM_CMPR0_B_UPMETHOD_S))
#define MCPWM_CMPR0_B_UPMETHOD_V  0xF
#define MCPWM_CMPR0_B_UPMETHOD_S  4
/* MCPWM_CMPR0_A_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: 0: immediate, bit0: tez, bit1: tep, bit2: sync, bit3: freeze.*/
#define MCPWM_CMPR0_A_UPMETHOD    0x0000000F
#define MCPWM_CMPR0_A_UPMETHOD_M  ((MCPWM_CMPR0_A_UPMETHOD_V)<<(MCPWM_CMPR0_A_UPMETHOD_S))
#define MCPWM_CMPR0_A_UPMETHOD_V  0xF
#define MCPWM_CMPR0_A_UPMETHOD_S  0

#define MCPWM_CMPR0_VALUE0_REG(i)          (REG_MCPWM_BASE(i) + 0x40)
/* MCPWM_CMPR0_A : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: .*/
#define MCPWM_CMPR0_A    0x0000FFFF
#define MCPWM_CMPR0_A_M  ((MCPWM_CMPR0_A_V)<<(MCPWM_CMPR0_A_S))
#define MCPWM_CMPR0_A_V  0xFFFF
#define MCPWM_CMPR0_A_S  0

#define MCPWM_CMPR0_VALUE1_REG(i)          (REG_MCPWM_BASE(i) + 0x44)
/* MCPWM_CMPR0_B : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: .*/
#define MCPWM_CMPR0_B    0x0000FFFF
#define MCPWM_CMPR0_B_M  ((MCPWM_CMPR0_B_V)<<(MCPWM_CMPR0_B_S))
#define MCPWM_CMPR0_B_V  0xFFFF
#define MCPWM_CMPR0_B_S  0

#define MCPWM_GEN0_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0x48)
/* MCPWM_GEN0_T1_SEL : R/W ;bitpos:[9:7] ;default: 3'd0 ; */
/*description: take effect immediately, 0: extra0, 1: extra1, 2: extra2, 3: sync_taken, 4: none.*/
#define MCPWM_GEN0_T1_SEL    0x00000007
#define MCPWM_GEN0_T1_SEL_M  ((MCPWM_GEN0_T1_SEL_V)<<(MCPWM_GEN0_T1_SEL_S))
#define MCPWM_GEN0_T1_SEL_V  0x7
#define MCPWM_GEN0_T1_SEL_S  7
/* MCPWM_GEN0_T0_SEL : R/W ;bitpos:[6:4] ;default: 3'd0 ; */
/*description: take effect immediately, 0: extra0, 1: extra1, 2: extra2, 3: sync_taken, 4: none.*/
#define MCPWM_GEN0_T0_SEL    0x00000007
#define MCPWM_GEN0_T0_SEL_M  ((MCPWM_GEN0_T0_SEL_V)<<(MCPWM_GEN0_T0_SEL_S))
#define MCPWM_GEN0_T0_SEL_V  0x7
#define MCPWM_GEN0_T0_SEL_S  4
/* MCPWM_GEN0_CFG_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: 0: immediate, bit0: tez, bit1: tep, bit2: sync. bit3: freeze.*/
#define MCPWM_GEN0_CFG_UPMETHOD    0x0000000F
#define MCPWM_GEN0_CFG_UPMETHOD_M  ((MCPWM_GEN0_CFG_UPMETHOD_V)<<(MCPWM_GEN0_CFG_UPMETHOD_S))
#define MCPWM_GEN0_CFG_UPMETHOD_V  0xF
#define MCPWM_GEN0_CFG_UPMETHOD_S  0

#define MCPWM_GEN0_FORCE_REG(i)          (REG_MCPWM_BASE(i) + 0x4C)
/* MCPWM_GEN0_B_NCIFORCE_MODE : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: 0: disabled, 1: low, 2: high, 3: disabled.*/
#define MCPWM_GEN0_B_NCIFORCE_MODE    0x00000003
#define MCPWM_GEN0_B_NCIFORCE_MODE_M  ((MCPWM_GEN0_B_NCIFORCE_MODE_V)<<(MCPWM_GEN0_B_NCIFORCE_MODE_S))
#define MCPWM_GEN0_B_NCIFORCE_MODE_V  0x3
#define MCPWM_GEN0_B_NCIFORCE_MODE_S  14
/* MCPWM_GEN0_B_NCIFORCE : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: non-continuous immediate sw force, a toggle will trigger a force event.*/
#define MCPWM_GEN0_B_NCIFORCE    (BIT(13))
#define MCPWM_GEN0_B_NCIFORCE_M  (BIT(13))
#define MCPWM_GEN0_B_NCIFORCE_V  0x1
#define MCPWM_GEN0_B_NCIFORCE_S  13
/* MCPWM_GEN0_A_NCIFORCE_MODE : R/W ;bitpos:[12:11] ;default: 2'd0 ; */
/*description: 0: disabled, 1: low, 2: high, 3: disabled.*/
#define MCPWM_GEN0_A_NCIFORCE_MODE    0x00000003
#define MCPWM_GEN0_A_NCIFORCE_MODE_M  ((MCPWM_GEN0_A_NCIFORCE_MODE_V)<<(MCPWM_GEN0_A_NCIFORCE_MODE_S))
#define MCPWM_GEN0_A_NCIFORCE_MODE_V  0x3
#define MCPWM_GEN0_A_NCIFORCE_MODE_S  11
/* MCPWM_GEN0_A_NCIFORCE : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: non-continuous immediate sw force, a toggle will trigger a force event.*/
#define MCPWM_GEN0_A_NCIFORCE    (BIT(10))
#define MCPWM_GEN0_A_NCIFORCE_M  (BIT(10))
#define MCPWM_GEN0_A_NCIFORCE_V  0x1
#define MCPWM_GEN0_A_NCIFORCE_S  10
/* MCPWM_GEN0_B_CNTUFORCE_MODE : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: 0: disabled, 1: low, 2: high, 3: disabled.*/
#define MCPWM_GEN0_B_CNTUFORCE_MODE    0x00000003
#define MCPWM_GEN0_B_CNTUFORCE_MODE_M  ((MCPWM_GEN0_B_CNTUFORCE_MODE_V)<<(MCPWM_GEN0_B_CNTUFORCE_MODE_S))
#define MCPWM_GEN0_B_CNTUFORCE_MODE_V  0x3
#define MCPWM_GEN0_B_CNTUFORCE_MODE_S  8
/* MCPWM_GEN0_A_CNTUFORCE_MODE : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: 0: disabled, 1: low, 2: high, 3: disabled.*/
#define MCPWM_GEN0_A_CNTUFORCE_MODE    0x00000003
#define MCPWM_GEN0_A_CNTUFORCE_MODE_M  ((MCPWM_GEN0_A_CNTUFORCE_MODE_V)<<(MCPWM_GEN0_A_CNTUFORCE_MODE_S))
#define MCPWM_GEN0_A_CNTUFORCE_MODE_V  0x3
#define MCPWM_GEN0_A_CNTUFORCE_MODE_S  6
/* MCPWM_GEN0_CNTUFORCE_UPMETHOD : R/W ;bitpos:[5:0] ;default: 6'h20 ; */
/*description: 0: immediate, bit0: tez, bit1: tep, bit2: tea, bit3: teb, bit4: sync, bit5: free
ze.*/
#define MCPWM_GEN0_CNTUFORCE_UPMETHOD    0x0000003F
#define MCPWM_GEN0_CNTUFORCE_UPMETHOD_M  ((MCPWM_GEN0_CNTUFORCE_UPMETHOD_V)<<(MCPWM_GEN0_CNTUFORCE_UPMETHOD_S))
#define MCPWM_GEN0_CNTUFORCE_UPMETHOD_V  0x3F
#define MCPWM_GEN0_CNTUFORCE_UPMETHOD_S  0

