espressif/esp-idf/components/soc/esp32s3/include/soc/mcpwm_reg.h
#define MCPWM_GEN0_A_REG(i)          (REG_MCPWM_BASE(i) + 0x50)
/* MCPWM_GEN0_A_DT1 : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: 0: no change, 1: low, 2: high, 3: toggle.*/
#define MCPWM_GEN0_A_DT1    0x00000003
#define MCPWM_GEN0_A_DT1_M  ((MCPWM_GEN0_A_DT1_V)<<(MCPWM_GEN0_A_DT1_S))
#define MCPWM_GEN0_A_DT1_V  0x3
#define MCPWM_GEN0_A_DT1_S  22
/* MCPWM_GEN0_A_DT0 : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_A_DT0    0x00000003
#define MCPWM_GEN0_A_DT0_M  ((MCPWM_GEN0_A_DT0_V)<<(MCPWM_GEN0_A_DT0_S))
#define MCPWM_GEN0_A_DT0_V  0x3
#define MCPWM_GEN0_A_DT0_S  20
/* MCPWM_GEN0_A_DTEB : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_A_DTEB    0x00000003
#define MCPWM_GEN0_A_DTEB_M  ((MCPWM_GEN0_A_DTEB_V)<<(MCPWM_GEN0_A_DTEB_S))
#define MCPWM_GEN0_A_DTEB_V  0x3
#define MCPWM_GEN0_A_DTEB_S  18
/* MCPWM_GEN0_A_DTEA : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_A_DTEA    0x00000003
#define MCPWM_GEN0_A_DTEA_M  ((MCPWM_GEN0_A_DTEA_V)<<(MCPWM_GEN0_A_DTEA_S))
#define MCPWM_GEN0_A_DTEA_V  0x3
#define MCPWM_GEN0_A_DTEA_S  16
/* MCPWM_GEN0_A_DTEP : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_A_DTEP    0x00000003
#define MCPWM_GEN0_A_DTEP_M  ((MCPWM_GEN0_A_DTEP_V)<<(MCPWM_GEN0_A_DTEP_S))
#define MCPWM_GEN0_A_DTEP_V  0x3
#define MCPWM_GEN0_A_DTEP_S  14
/* MCPWM_GEN0_A_DTEZ : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_A_DTEZ    0x00000003
#define MCPWM_GEN0_A_DTEZ_M  ((MCPWM_GEN0_A_DTEZ_V)<<(MCPWM_GEN0_A_DTEZ_S))
#define MCPWM_GEN0_A_DTEZ_V  0x3
#define MCPWM_GEN0_A_DTEZ_S  12
/* MCPWM_GEN0_A_UT1 : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_A_UT1    0x00000003
#define MCPWM_GEN0_A_UT1_M  ((MCPWM_GEN0_A_UT1_V)<<(MCPWM_GEN0_A_UT1_S))
#define MCPWM_GEN0_A_UT1_V  0x3
#define MCPWM_GEN0_A_UT1_S  10
/* MCPWM_GEN0_A_UT0 : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_A_UT0    0x00000003
#define MCPWM_GEN0_A_UT0_M  ((MCPWM_GEN0_A_UT0_V)<<(MCPWM_GEN0_A_UT0_S))
#define MCPWM_GEN0_A_UT0_V  0x3
#define MCPWM_GEN0_A_UT0_S  8
/* MCPWM_GEN0_A_UTEB : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_A_UTEB    0x00000003
#define MCPWM_GEN0_A_UTEB_M  ((MCPWM_GEN0_A_UTEB_V)<<(MCPWM_GEN0_A_UTEB_S))
#define MCPWM_GEN0_A_UTEB_V  0x3
#define MCPWM_GEN0_A_UTEB_S  6
/* MCPWM_GEN0_A_UTEA : R/W ;bitpos:[5:4] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_A_UTEA    0x00000003
#define MCPWM_GEN0_A_UTEA_M  ((MCPWM_GEN0_A_UTEA_V)<<(MCPWM_GEN0_A_UTEA_S))
#define MCPWM_GEN0_A_UTEA_V  0x3
#define MCPWM_GEN0_A_UTEA_S  4
/* MCPWM_GEN0_A_UTEP : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_A_UTEP    0x00000003
#define MCPWM_GEN0_A_UTEP_M  ((MCPWM_GEN0_A_UTEP_V)<<(MCPWM_GEN0_A_UTEP_S))
#define MCPWM_GEN0_A_UTEP_V  0x3
#define MCPWM_GEN0_A_UTEP_S  2
/* MCPWM_GEN0_A_UTEZ : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_A_UTEZ    0x00000003
#define MCPWM_GEN0_A_UTEZ_M  ((MCPWM_GEN0_A_UTEZ_V)<<(MCPWM_GEN0_A_UTEZ_S))
#define MCPWM_GEN0_A_UTEZ_V  0x3
#define MCPWM_GEN0_A_UTEZ_S  0

#define MCPWM_GEN0_B_REG(i)          (REG_MCPWM_BASE(i) + 0x54)
/* MCPWM_GEN0_B_DT1 : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_B_DT1    0x00000003
#define MCPWM_GEN0_B_DT1_M  ((MCPWM_GEN0_B_DT1_V)<<(MCPWM_GEN0_B_DT1_S))
#define MCPWM_GEN0_B_DT1_V  0x3
#define MCPWM_GEN0_B_DT1_S  22
/* MCPWM_GEN0_B_DT0 : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_B_DT0    0x00000003
#define MCPWM_GEN0_B_DT0_M  ((MCPWM_GEN0_B_DT0_V)<<(MCPWM_GEN0_B_DT0_S))
#define MCPWM_GEN0_B_DT0_V  0x3
#define MCPWM_GEN0_B_DT0_S  20
/* MCPWM_GEN0_B_DTEB : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_B_DTEB    0x00000003
#define MCPWM_GEN0_B_DTEB_M  ((MCPWM_GEN0_B_DTEB_V)<<(MCPWM_GEN0_B_DTEB_S))
#define MCPWM_GEN0_B_DTEB_V  0x3
#define MCPWM_GEN0_B_DTEB_S  18
/* MCPWM_GEN0_B_DTEA : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_B_DTEA    0x00000003
#define MCPWM_GEN0_B_DTEA_M  ((MCPWM_GEN0_B_DTEA_V)<<(MCPWM_GEN0_B_DTEA_S))
#define MCPWM_GEN0_B_DTEA_V  0x3
#define MCPWM_GEN0_B_DTEA_S  16
/* MCPWM_GEN0_B_DTEP : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_B_DTEP    0x00000003
#define MCPWM_GEN0_B_DTEP_M  ((MCPWM_GEN0_B_DTEP_V)<<(MCPWM_GEN0_B_DTEP_S))
#define MCPWM_GEN0_B_DTEP_V  0x3
#define MCPWM_GEN0_B_DTEP_S  14
/* MCPWM_GEN0_B_DTEZ : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_B_DTEZ    0x00000003
#define MCPWM_GEN0_B_DTEZ_M  ((MCPWM_GEN0_B_DTEZ_V)<<(MCPWM_GEN0_B_DTEZ_S))
#define MCPWM_GEN0_B_DTEZ_V  0x3
#define MCPWM_GEN0_B_DTEZ_S  12
/* MCPWM_GEN0_B_UT1 : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_B_UT1    0x00000003
#define MCPWM_GEN0_B_UT1_M  ((MCPWM_GEN0_B_UT1_V)<<(MCPWM_GEN0_B_UT1_S))
#define MCPWM_GEN0_B_UT1_V  0x3
#define MCPWM_GEN0_B_UT1_S  10
/* MCPWM_GEN0_B_UT0 : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_B_UT0    0x00000003
#define MCPWM_GEN0_B_UT0_M  ((MCPWM_GEN0_B_UT0_V)<<(MCPWM_GEN0_B_UT0_S))
#define MCPWM_GEN0_B_UT0_V  0x3
#define MCPWM_GEN0_B_UT0_S  8
/* MCPWM_GEN0_B_UTEB : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_B_UTEB    0x00000003
#define MCPWM_GEN0_B_UTEB_M  ((MCPWM_GEN0_B_UTEB_V)<<(MCPWM_GEN0_B_UTEB_S))
#define MCPWM_GEN0_B_UTEB_V  0x3
#define MCPWM_GEN0_B_UTEB_S  6
/* MCPWM_GEN0_B_UTEA : R/W ;bitpos:[5:4] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_B_UTEA    0x00000003
#define MCPWM_GEN0_B_UTEA_M  ((MCPWM_GEN0_B_UTEA_V)<<(MCPWM_GEN0_B_UTEA_S))
#define MCPWM_GEN0_B_UTEA_V  0x3
#define MCPWM_GEN0_B_UTEA_S  4
/* MCPWM_GEN0_B_UTEP : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_B_UTEP    0x00000003
#define MCPWM_GEN0_B_UTEP_M  ((MCPWM_GEN0_B_UTEP_V)<<(MCPWM_GEN0_B_UTEP_S))
#define MCPWM_GEN0_B_UTEP_V  0x3
#define MCPWM_GEN0_B_UTEP_S  2
/* MCPWM_GEN0_B_UTEZ : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN0_B_UTEZ    0x00000003
#define MCPWM_GEN0_B_UTEZ_M  ((MCPWM_GEN0_B_UTEZ_V)<<(MCPWM_GEN0_B_UTEZ_S))
#define MCPWM_GEN0_B_UTEZ_V  0x3
#define MCPWM_GEN0_B_UTEZ_S  0

