espressif/esp-idf/components/soc/esp32s3/include/soc/mcpwm_reg.h
#define MCPWM_TZ0_CFG1_REG(i)          (REG_MCPWM_BASE(i) + 0x6C)
/* MCPWM_TZ0_FORCE_OST : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: a toggle trigger a oneshot tripping.*/
#define MCPWM_TZ0_FORCE_OST    (BIT(4))
#define MCPWM_TZ0_FORCE_OST_M  (BIT(4))
#define MCPWM_TZ0_FORCE_OST_V  0x1
#define MCPWM_TZ0_FORCE_OST_S  4
/* MCPWM_TZ0_FORCE_CBC : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: a toggle trigger a cycle-by-cycle tripping.*/
#define MCPWM_TZ0_FORCE_CBC    (BIT(3))
#define MCPWM_TZ0_FORCE_CBC_M  (BIT(3))
#define MCPWM_TZ0_FORCE_CBC_V  0x1
#define MCPWM_TZ0_FORCE_CBC_S  3
/* MCPWM_TZ0_CBCPULSE : R/W ;bitpos:[2:1] ;default: 2'd0 ; */
/*description: bit0: tez, bit1: tep.*/
#define MCPWM_TZ0_CBCPULSE    0x00000003
#define MCPWM_TZ0_CBCPULSE_M  ((MCPWM_TZ0_CBCPULSE_V)<<(MCPWM_TZ0_CBCPULSE_S))
#define MCPWM_TZ0_CBCPULSE_V  0x3
#define MCPWM_TZ0_CBCPULSE_S  1
/* MCPWM_TZ0_CLR_OST : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: a toggle will clear oneshot tripping.*/
#define MCPWM_TZ0_CLR_OST    (BIT(0))
#define MCPWM_TZ0_CLR_OST_M  (BIT(0))
#define MCPWM_TZ0_CLR_OST_V  0x1
#define MCPWM_TZ0_CLR_OST_S  0

#define MCPWM_TZ0_STATUS_REG(i)          (REG_MCPWM_BASE(i) + 0x70)
/* MCPWM_TZ0_OST_ON : RO ;bitpos:[1] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ0_OST_ON    (BIT(1))
#define MCPWM_TZ0_OST_ON_M  (BIT(1))
#define MCPWM_TZ0_OST_ON_V  0x1
#define MCPWM_TZ0_OST_ON_S  1
/* MCPWM_TZ0_CBC_ON : RO ;bitpos:[0] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ0_CBC_ON    (BIT(0))
#define MCPWM_TZ0_CBC_ON_M  (BIT(0))
#define MCPWM_TZ0_CBC_ON_V  0x1
#define MCPWM_TZ0_CBC_ON_S  0

#define MCPWM_CMPR1_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x74)
/* MCPWM_CMPR1_B_SHDW_FULL : R/W ;bitpos:[9] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR1_B_SHDW_FULL    (BIT(9))
#define MCPWM_CMPR1_B_SHDW_FULL_M  (BIT(9))
#define MCPWM_CMPR1_B_SHDW_FULL_V  0x1
#define MCPWM_CMPR1_B_SHDW_FULL_S  9
/* MCPWM_CMPR1_A_SHDW_FULL : R/W ;bitpos:[8] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR1_A_SHDW_FULL    (BIT(8))
#define MCPWM_CMPR1_A_SHDW_FULL_M  (BIT(8))
#define MCPWM_CMPR1_A_SHDW_FULL_V  0x1
#define MCPWM_CMPR1_A_SHDW_FULL_S  8
/* MCPWM_CMPR1_B_UPMETHOD : R/W ;bitpos:[7:4] ;default: 4'd0 ; */
/*description: 0: immediate, bit0: tez, bit1: tep, bit2: sync, bit3: freeze.*/
#define MCPWM_CMPR1_B_UPMETHOD    0x0000000F
#define MCPWM_CMPR1_B_UPMETHOD_M  ((MCPWM_CMPR1_B_UPMETHOD_V)<<(MCPWM_CMPR1_B_UPMETHOD_S))
#define MCPWM_CMPR1_B_UPMETHOD_V  0xF
#define MCPWM_CMPR1_B_UPMETHOD_S  4
/* MCPWM_CMPR1_A_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: 0: immediate, bit0: tez, bit1: tep, bit2: sync, bit3: freeze.*/
#define MCPWM_CMPR1_A_UPMETHOD    0x0000000F
#define MCPWM_CMPR1_A_UPMETHOD_M  ((MCPWM_CMPR1_A_UPMETHOD_V)<<(MCPWM_CMPR1_A_UPMETHOD_S))
#define MCPWM_CMPR1_A_UPMETHOD_V  0xF
#define MCPWM_CMPR1_A_UPMETHOD_S  0

#define MCPWM_CMPR1_VALUE0_REG(i)          (REG_MCPWM_BASE(i) + 0x78)
/* MCPWM_CMPR1_A : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: .*/
#define MCPWM_CMPR1_A    0x0000FFFF
#define MCPWM_CMPR1_A_M  ((MCPWM_CMPR1_A_V)<<(MCPWM_CMPR1_A_S))
#define MCPWM_CMPR1_A_V  0xFFFF
#define MCPWM_CMPR1_A_S  0

#define MCPWM_CMPR1_VALUE1_REG(i)          (REG_MCPWM_BASE(i) + 0x7C)
/* MCPWM_CMPR1_B : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: .*/
#define MCPWM_CMPR1_B    0x0000FFFF
#define MCPWM_CMPR1_B_M  ((MCPWM_CMPR1_B_V)<<(MCPWM_CMPR1_B_S))
#define MCPWM_CMPR1_B_V  0xFFFF
#define MCPWM_CMPR1_B_S  0

#define MCPWM_GEN1_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0x80)
/* MCPWM_GEN1_T1_SEL : R/W ;bitpos:[9:7] ;default: 3'd0 ; */
/*description: take effect immediately, 0: extra0, 1: extra1, 2: extra2, 3: sync_taken, 4: none.*/
#define MCPWM_GEN1_T1_SEL    0x00000007
#define MCPWM_GEN1_T1_SEL_M  ((MCPWM_GEN1_T1_SEL_V)<<(MCPWM_GEN1_T1_SEL_S))
#define MCPWM_GEN1_T1_SEL_V  0x7
#define MCPWM_GEN1_T1_SEL_S  7
/* MCPWM_GEN1_T0_SEL : R/W ;bitpos:[6:4] ;default: 3'd0 ; */
/*description: take effect immediately, 0: extra0, 1: extra1, 2: extra2, 3: sync_taken, 4: none.*/
#define MCPWM_GEN1_T0_SEL    0x00000007
#define MCPWM_GEN1_T0_SEL_M  ((MCPWM_GEN1_T0_SEL_V)<<(MCPWM_GEN1_T0_SEL_S))
#define MCPWM_GEN1_T0_SEL_V  0x7
#define MCPWM_GEN1_T0_SEL_S  4
/* MCPWM_GEN1_CFG_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: 0: immediate, bit0: tez, bit1: tep, bit2: sync. bit3: freeze.*/
#define MCPWM_GEN1_CFG_UPMETHOD    0x0000000F
#define MCPWM_GEN1_CFG_UPMETHOD_M  ((MCPWM_GEN1_CFG_UPMETHOD_V)<<(MCPWM_GEN1_CFG_UPMETHOD_S))
#define MCPWM_GEN1_CFG_UPMETHOD_V  0xF
#define MCPWM_GEN1_CFG_UPMETHOD_S  0

#define MCPWM_GEN1_FORCE_REG(i)          (REG_MCPWM_BASE(i) + 0x84)
/* MCPWM_GEN1_B_NCIFORCE_MODE : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: 0: disabled, 1: low, 2: high, 3: disabled.*/
#define MCPWM_GEN1_B_NCIFORCE_MODE    0x00000003
#define MCPWM_GEN1_B_NCIFORCE_MODE_M  ((MCPWM_GEN1_B_NCIFORCE_MODE_V)<<(MCPWM_GEN1_B_NCIFORCE_MODE_S))
#define MCPWM_GEN1_B_NCIFORCE_MODE_V  0x3
#define MCPWM_GEN1_B_NCIFORCE_MODE_S  14
/* MCPWM_GEN1_B_NCIFORCE : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: non-continuous immediate sw force, a toggle will trigger a force event.*/
#define MCPWM_GEN1_B_NCIFORCE    (BIT(13))
#define MCPWM_GEN1_B_NCIFORCE_M  (BIT(13))
#define MCPWM_GEN1_B_NCIFORCE_V  0x1
#define MCPWM_GEN1_B_NCIFORCE_S  13
/* MCPWM_GEN1_A_NCIFORCE_MODE : R/W ;bitpos:[12:11] ;default: 2'd0 ; */
/*description: 0: disabled, 1: low, 2: high, 3: disabled.*/
#define MCPWM_GEN1_A_NCIFORCE_MODE    0x00000003
#define MCPWM_GEN1_A_NCIFORCE_MODE_M  ((MCPWM_GEN1_A_NCIFORCE_MODE_V)<<(MCPWM_GEN1_A_NCIFORCE_MODE_S))
#define MCPWM_GEN1_A_NCIFORCE_MODE_V  0x3
#define MCPWM_GEN1_A_NCIFORCE_MODE_S  11
/* MCPWM_GEN1_A_NCIFORCE : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: non-continuous immediate sw force, a toggle will trigger a force event.*/
#define MCPWM_GEN1_A_NCIFORCE    (BIT(10))
#define MCPWM_GEN1_A_NCIFORCE_M  (BIT(10))
#define MCPWM_GEN1_A_NCIFORCE_V  0x1
#define MCPWM_GEN1_A_NCIFORCE_S  10
/* MCPWM_GEN1_B_CNTUFORCE_MODE : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: 0: disabled, 1: low, 2: high, 3: disabled.*/
#define MCPWM_GEN1_B_CNTUFORCE_MODE    0x00000003
#define MCPWM_GEN1_B_CNTUFORCE_MODE_M  ((MCPWM_GEN1_B_CNTUFORCE_MODE_V)<<(MCPWM_GEN1_B_CNTUFORCE_MODE_S))
#define MCPWM_GEN1_B_CNTUFORCE_MODE_V  0x3
#define MCPWM_GEN1_B_CNTUFORCE_MODE_S  8
/* MCPWM_GEN1_A_CNTUFORCE_MODE : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: 0: disabled, 1: low, 2: high, 3: disabled.*/
#define MCPWM_GEN1_A_CNTUFORCE_MODE    0x00000003
#define MCPWM_GEN1_A_CNTUFORCE_MODE_M  ((MCPWM_GEN1_A_CNTUFORCE_MODE_V)<<(MCPWM_GEN1_A_CNTUFORCE_MODE_S))
#define MCPWM_GEN1_A_CNTUFORCE_MODE_V  0x3
#define MCPWM_GEN1_A_CNTUFORCE_MODE_S  6
/* MCPWM_GEN1_CNTUFORCE_UPMETHOD : R/W ;bitpos:[5:0] ;default: 6'h20 ; */
/*description: 0: immediate, bit0: tez, bit1: tep, bit2: tea, bit3: teb, bit4: sync, bit5: free
ze.*/
#define MCPWM_GEN1_CNTUFORCE_UPMETHOD    0x0000003F
#define MCPWM_GEN1_CNTUFORCE_UPMETHOD_M  ((MCPWM_GEN1_CNTUFORCE_UPMETHOD_V)<<(MCPWM_GEN1_CNTUFORCE_UPMETHOD_S))
#define MCPWM_GEN1_CNTUFORCE_UPMETHOD_V  0x3F
#define MCPWM_GEN1_CNTUFORCE_UPMETHOD_S  0

