espressif/esp-idf/components/soc/esp32s3/include/soc/mcpwm_reg.h
#define MCPWM_DB1_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x90)
/* MCPWM_DB1_CLK_SEL : R/W ;bitpos:[17] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB1_CLK_SEL    (BIT(17))
#define MCPWM_DB1_CLK_SEL_M  (BIT(17))
#define MCPWM_DB1_CLK_SEL_V  0x1
#define MCPWM_DB1_CLK_SEL_S  17
/* MCPWM_DB1_B_OUTBYPASS : R/W ;bitpos:[16] ;default: 1'd1 ; */
/*description: .*/
#define MCPWM_DB1_B_OUTBYPASS    (BIT(16))
#define MCPWM_DB1_B_OUTBYPASS_M  (BIT(16))
#define MCPWM_DB1_B_OUTBYPASS_V  0x1
#define MCPWM_DB1_B_OUTBYPASS_S  16
/* MCPWM_DB1_A_OUTBYPASS : R/W ;bitpos:[15] ;default: 1'd1 ; */
/*description: .*/
#define MCPWM_DB1_A_OUTBYPASS    (BIT(15))
#define MCPWM_DB1_A_OUTBYPASS_M  (BIT(15))
#define MCPWM_DB1_A_OUTBYPASS_V  0x1
#define MCPWM_DB1_A_OUTBYPASS_S  15
/* MCPWM_DB1_FED_OUTINVERT : R/W ;bitpos:[14] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB1_FED_OUTINVERT    (BIT(14))
#define MCPWM_DB1_FED_OUTINVERT_M  (BIT(14))
#define MCPWM_DB1_FED_OUTINVERT_V  0x1
#define MCPWM_DB1_FED_OUTINVERT_S  14
/* MCPWM_DB1_RED_OUTINVERT : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB1_RED_OUTINVERT    (BIT(13))
#define MCPWM_DB1_RED_OUTINVERT_M  (BIT(13))
#define MCPWM_DB1_RED_OUTINVERT_V  0x1
#define MCPWM_DB1_RED_OUTINVERT_S  13
/* MCPWM_DB1_FED_INSEL : R/W ;bitpos:[12] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB1_FED_INSEL    (BIT(12))
#define MCPWM_DB1_FED_INSEL_M  (BIT(12))
#define MCPWM_DB1_FED_INSEL_V  0x1
#define MCPWM_DB1_FED_INSEL_S  12
/* MCPWM_DB1_RED_INSEL : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB1_RED_INSEL    (BIT(11))
#define MCPWM_DB1_RED_INSEL_M  (BIT(11))
#define MCPWM_DB1_RED_INSEL_V  0x1
#define MCPWM_DB1_RED_INSEL_S  11
/* MCPWM_DB1_B_OUTSWAP : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB1_B_OUTSWAP    (BIT(10))
#define MCPWM_DB1_B_OUTSWAP_M  (BIT(10))
#define MCPWM_DB1_B_OUTSWAP_V  0x1
#define MCPWM_DB1_B_OUTSWAP_S  10
/* MCPWM_DB1_A_OUTSWAP : R/W ;bitpos:[9] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB1_A_OUTSWAP    (BIT(9))
#define MCPWM_DB1_A_OUTSWAP_M  (BIT(9))
#define MCPWM_DB1_A_OUTSWAP_V  0x1
#define MCPWM_DB1_A_OUTSWAP_S  9
/* MCPWM_DB1_DEB_MODE : R/W ;bitpos:[8] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB1_DEB_MODE    (BIT(8))
#define MCPWM_DB1_DEB_MODE_M  (BIT(8))
#define MCPWM_DB1_DEB_MODE_V  0x1
#define MCPWM_DB1_DEB_MODE_S  8
/* MCPWM_DB1_RED_UPMETHOD : R/W ;bitpos:[7:4] ;default: 4'd0 ; */
/*description: .*/
#define MCPWM_DB1_RED_UPMETHOD    0x0000000F
#define MCPWM_DB1_RED_UPMETHOD_M  ((MCPWM_DB1_RED_UPMETHOD_V)<<(MCPWM_DB1_RED_UPMETHOD_S))
#define MCPWM_DB1_RED_UPMETHOD_V  0xF
#define MCPWM_DB1_RED_UPMETHOD_S  4
/* MCPWM_DB1_FED_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: .*/
#define MCPWM_DB1_FED_UPMETHOD    0x0000000F
#define MCPWM_DB1_FED_UPMETHOD_M  ((MCPWM_DB1_FED_UPMETHOD_V)<<(MCPWM_DB1_FED_UPMETHOD_S))
#define MCPWM_DB1_FED_UPMETHOD_V  0xF
#define MCPWM_DB1_FED_UPMETHOD_S  0

#define MCPWM_DB1_FED_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x94)
/* MCPWM_DB1_FED : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: .*/
#define MCPWM_DB1_FED    0x0000FFFF
#define MCPWM_DB1_FED_M  ((MCPWM_DB1_FED_V)<<(MCPWM_DB1_FED_S))
#define MCPWM_DB1_FED_V  0xFFFF
#define MCPWM_DB1_FED_S  0

#define MCPWM_DB1_RED_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x98)
/* MCPWM_DB1_RED : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: .*/
#define MCPWM_DB1_RED    0x0000FFFF
#define MCPWM_DB1_RED_M  ((MCPWM_DB1_RED_V)<<(MCPWM_DB1_RED_S))
#define MCPWM_DB1_RED_V  0xFFFF
#define MCPWM_DB1_RED_S  0

#define MCPWM_CHOPPER1_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x9C)
/* MCPWM_CHOPPER1_IN_INVERT : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CHOPPER1_IN_INVERT    (BIT(13))
#define MCPWM_CHOPPER1_IN_INVERT_M  (BIT(13))
#define MCPWM_CHOPPER1_IN_INVERT_V  0x1
#define MCPWM_CHOPPER1_IN_INVERT_S  13
/* MCPWM_CHOPPER1_OUT_INVERT : R/W ;bitpos:[12] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CHOPPER1_OUT_INVERT    (BIT(12))
#define MCPWM_CHOPPER1_OUT_INVERT_M  (BIT(12))
#define MCPWM_CHOPPER1_OUT_INVERT_V  0x1
#define MCPWM_CHOPPER1_OUT_INVERT_S  12
/* MCPWM_CHOPPER1_OSHTWTH : R/W ;bitpos:[11:8] ;default: 4'd0 ; */
/*description: .*/
#define MCPWM_CHOPPER1_OSHTWTH    0x0000000F
#define MCPWM_CHOPPER1_OSHTWTH_M  ((MCPWM_CHOPPER1_OSHTWTH_V)<<(MCPWM_CHOPPER1_OSHTWTH_S))
#define MCPWM_CHOPPER1_OSHTWTH_V  0xF
#define MCPWM_CHOPPER1_OSHTWTH_S  8
/* MCPWM_CHOPPER1_DUTY : R/W ;bitpos:[7:5] ;default: 3'd0 ; */
/*description: .*/
#define MCPWM_CHOPPER1_DUTY    0x00000007
#define MCPWM_CHOPPER1_DUTY_M  ((MCPWM_CHOPPER1_DUTY_V)<<(MCPWM_CHOPPER1_DUTY_S))
#define MCPWM_CHOPPER1_DUTY_V  0x7
#define MCPWM_CHOPPER1_DUTY_S  5
/* MCPWM_CHOPPER1_PRESCALE : R/W ;bitpos:[4:1] ;default: 4'd0 ; */
/*description: .*/
#define MCPWM_CHOPPER1_PRESCALE    0x0000000F
#define MCPWM_CHOPPER1_PRESCALE_M  ((MCPWM_CHOPPER1_PRESCALE_V)<<(MCPWM_CHOPPER1_PRESCALE_S))
#define MCPWM_CHOPPER1_PRESCALE_V  0xF
#define MCPWM_CHOPPER1_PRESCALE_S  1
/* MCPWM_CHOPPER1_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CHOPPER1_EN    (BIT(0))
#define MCPWM_CHOPPER1_EN_M  (BIT(0))
#define MCPWM_CHOPPER1_EN_V  0x1
#define MCPWM_CHOPPER1_EN_S  0

#define MCPWM_TZ1_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0xA0)
/* MCPWM_TZ1_B_OST_U : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ1_B_OST_U    0x00000003
#define MCPWM_TZ1_B_OST_U_M  ((MCPWM_TZ1_B_OST_U_V)<<(MCPWM_TZ1_B_OST_U_S))
#define MCPWM_TZ1_B_OST_U_V  0x3
#define MCPWM_TZ1_B_OST_U_S  22
/* MCPWM_TZ1_B_OST_D : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ1_B_OST_D    0x00000003
#define MCPWM_TZ1_B_OST_D_M  ((MCPWM_TZ1_B_OST_D_V)<<(MCPWM_TZ1_B_OST_D_S))
#define MCPWM_TZ1_B_OST_D_V  0x3
#define MCPWM_TZ1_B_OST_D_S  20
/* MCPWM_TZ1_B_CBC_U : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ1_B_CBC_U    0x00000003
#define MCPWM_TZ1_B_CBC_U_M  ((MCPWM_TZ1_B_CBC_U_V)<<(MCPWM_TZ1_B_CBC_U_S))
#define MCPWM_TZ1_B_CBC_U_V  0x3
#define MCPWM_TZ1_B_CBC_U_S  18
/* MCPWM_TZ1_B_CBC_D : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ1_B_CBC_D    0x00000003
#define MCPWM_TZ1_B_CBC_D_M  ((MCPWM_TZ1_B_CBC_D_V)<<(MCPWM_TZ1_B_CBC_D_S))
#define MCPWM_TZ1_B_CBC_D_V  0x3
#define MCPWM_TZ1_B_CBC_D_S  16
/* MCPWM_TZ1_A_OST_U : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ1_A_OST_U    0x00000003
#define MCPWM_TZ1_A_OST_U_M  ((MCPWM_TZ1_A_OST_U_V)<<(MCPWM_TZ1_A_OST_U_S))
#define MCPWM_TZ1_A_OST_U_V  0x3
#define MCPWM_TZ1_A_OST_U_S  14
/* MCPWM_TZ1_A_OST_D : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ1_A_OST_D    0x00000003
#define MCPWM_TZ1_A_OST_D_M  ((MCPWM_TZ1_A_OST_D_V)<<(MCPWM_TZ1_A_OST_D_S))
#define MCPWM_TZ1_A_OST_D_V  0x3
#define MCPWM_TZ1_A_OST_D_S  12
/* MCPWM_TZ1_A_CBC_U : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ1_A_CBC_U    0x00000003
#define MCPWM_TZ1_A_CBC_U_M  ((MCPWM_TZ1_A_CBC_U_V)<<(MCPWM_TZ1_A_CBC_U_S))
#define MCPWM_TZ1_A_CBC_U_V  0x3
#define MCPWM_TZ1_A_CBC_U_S  10
/* MCPWM_TZ1_A_CBC_D : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ1_A_CBC_D    0x00000003
#define MCPWM_TZ1_A_CBC_D_M  ((MCPWM_TZ1_A_CBC_D_V)<<(MCPWM_TZ1_A_CBC_D_S))
#define MCPWM_TZ1_A_CBC_D_V  0x3
#define MCPWM_TZ1_A_CBC_D_S  8
/* MCPWM_TZ1_F0_OST : R/W ;bitpos:[7] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ1_F0_OST    (BIT(7))
#define MCPWM_TZ1_F0_OST_M  (BIT(7))
#define MCPWM_TZ1_F0_OST_V  0x1
#define MCPWM_TZ1_F0_OST_S  7
/* MCPWM_TZ1_F1_OST : R/W ;bitpos:[6] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ1_F1_OST    (BIT(6))
#define MCPWM_TZ1_F1_OST_M  (BIT(6))
#define MCPWM_TZ1_F1_OST_V  0x1
#define MCPWM_TZ1_F1_OST_S  6
/* MCPWM_TZ1_F2_OST : R/W ;bitpos:[5] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ1_F2_OST    (BIT(5))
#define MCPWM_TZ1_F2_OST_M  (BIT(5))
#define MCPWM_TZ1_F2_OST_V  0x1
#define MCPWM_TZ1_F2_OST_S  5
/* MCPWM_TZ1_SW_OST : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ1_SW_OST    (BIT(4))
#define MCPWM_TZ1_SW_OST_M  (BIT(4))
#define MCPWM_TZ1_SW_OST_V  0x1
#define MCPWM_TZ1_SW_OST_S  4
/* MCPWM_TZ1_F0_CBC : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ1_F0_CBC    (BIT(3))
#define MCPWM_TZ1_F0_CBC_M  (BIT(3))
#define MCPWM_TZ1_F0_CBC_V  0x1
#define MCPWM_TZ1_F0_CBC_S  3
/* MCPWM_TZ1_F1_CBC : R/W ;bitpos:[2] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ1_F1_CBC    (BIT(2))
#define MCPWM_TZ1_F1_CBC_M  (BIT(2))
#define MCPWM_TZ1_F1_CBC_V  0x1
#define MCPWM_TZ1_F1_CBC_S  2
/* MCPWM_TZ1_F2_CBC : R/W ;bitpos:[1] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ1_F2_CBC    (BIT(1))
#define MCPWM_TZ1_F2_CBC_M  (BIT(1))
#define MCPWM_TZ1_F2_CBC_V  0x1
#define MCPWM_TZ1_F2_CBC_S  1
/* MCPWM_TZ1_SW_CBC : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ1_SW_CBC    (BIT(0))
#define MCPWM_TZ1_SW_CBC_M  (BIT(0))
#define MCPWM_TZ1_SW_CBC_V  0x1
#define MCPWM_TZ1_SW_CBC_S  0

#define MCPWM_TZ1_CFG1_REG(i)          (REG_MCPWM_BASE(i) + 0xA4)
/* MCPWM_TZ1_FORCE_OST : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: a toggle trigger a oneshot tripping.*/
#define MCPWM_TZ1_FORCE_OST    (BIT(4))
#define MCPWM_TZ1_FORCE_OST_M  (BIT(4))
#define MCPWM_TZ1_FORCE_OST_V  0x1
#define MCPWM_TZ1_FORCE_OST_S  4
/* MCPWM_TZ1_FORCE_CBC : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: a toggle trigger a cycle-by-cycle tripping.*/
#define MCPWM_TZ1_FORCE_CBC    (BIT(3))
#define MCPWM_TZ1_FORCE_CBC_M  (BIT(3))
#define MCPWM_TZ1_FORCE_CBC_V  0x1
#define MCPWM_TZ1_FORCE_CBC_S  3
/* MCPWM_TZ1_CBCPULSE : R/W ;bitpos:[2:1] ;default: 2'd0 ; */
/*description: bit0: tez, bit1: tep.*/
#define MCPWM_TZ1_CBCPULSE    0x00000003
#define MCPWM_TZ1_CBCPULSE_M  ((MCPWM_TZ1_CBCPULSE_V)<<(MCPWM_TZ1_CBCPULSE_S))
#define MCPWM_TZ1_CBCPULSE_V  0x3
#define MCPWM_TZ1_CBCPULSE_S  1
/* MCPWM_TZ1_CLR_OST : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: a toggle will clear oneshot tripping.*/
#define MCPWM_TZ1_CLR_OST    (BIT(0))
#define MCPWM_TZ1_CLR_OST_M  (BIT(0))
#define MCPWM_TZ1_CLR_OST_V  0x1
#define MCPWM_TZ1_CLR_OST_S  0

