espressif/esp-idf/components/soc/esp32s3/include/soc/mcpwm_reg.h
#define MCPWM_TZ1_STATUS_REG(i)          (REG_MCPWM_BASE(i) + 0xA8)
/* MCPWM_TZ1_OST_ON : RO ;bitpos:[1] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ1_OST_ON    (BIT(1))
#define MCPWM_TZ1_OST_ON_M  (BIT(1))
#define MCPWM_TZ1_OST_ON_V  0x1
#define MCPWM_TZ1_OST_ON_S  1
/* MCPWM_TZ1_CBC_ON : RO ;bitpos:[0] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ1_CBC_ON    (BIT(0))
#define MCPWM_TZ1_CBC_ON_M  (BIT(0))
#define MCPWM_TZ1_CBC_ON_V  0x1
#define MCPWM_TZ1_CBC_ON_S  0

#define MCPWM_CMPR2_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0xAC)
/* MCPWM_CMPR2_B_SHDW_FULL : R/W ;bitpos:[9] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR2_B_SHDW_FULL    (BIT(9))
#define MCPWM_CMPR2_B_SHDW_FULL_M  (BIT(9))
#define MCPWM_CMPR2_B_SHDW_FULL_V  0x1
#define MCPWM_CMPR2_B_SHDW_FULL_S  9
/* MCPWM_CMPR2_A_SHDW_FULL : R/W ;bitpos:[8] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR2_A_SHDW_FULL    (BIT(8))
#define MCPWM_CMPR2_A_SHDW_FULL_M  (BIT(8))
#define MCPWM_CMPR2_A_SHDW_FULL_V  0x1
#define MCPWM_CMPR2_A_SHDW_FULL_S  8
/* MCPWM_CMPR2_B_UPMETHOD : R/W ;bitpos:[7:4] ;default: 4'd0 ; */
/*description: 0: immediate, bit0: tez, bit1: tep, bit2: sync, bit3: freeze.*/
#define MCPWM_CMPR2_B_UPMETHOD    0x0000000F
#define MCPWM_CMPR2_B_UPMETHOD_M  ((MCPWM_CMPR2_B_UPMETHOD_V)<<(MCPWM_CMPR2_B_UPMETHOD_S))
#define MCPWM_CMPR2_B_UPMETHOD_V  0xF
#define MCPWM_CMPR2_B_UPMETHOD_S  4
/* MCPWM_CMPR2_A_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: 0: immediate, bit0: tez, bit1: tep, bit2: sync, bit3: freeze.*/
#define MCPWM_CMPR2_A_UPMETHOD    0x0000000F
#define MCPWM_CMPR2_A_UPMETHOD_M  ((MCPWM_CMPR2_A_UPMETHOD_V)<<(MCPWM_CMPR2_A_UPMETHOD_S))
#define MCPWM_CMPR2_A_UPMETHOD_V  0xF
#define MCPWM_CMPR2_A_UPMETHOD_S  0

#define MCPWM_CMPR2_VALUE0_REG(i)          (REG_MCPWM_BASE(i) + 0xB0)
/* MCPWM_CMPR2_A : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: .*/
#define MCPWM_CMPR2_A    0x0000FFFF
#define MCPWM_CMPR2_A_M  ((MCPWM_CMPR2_A_V)<<(MCPWM_CMPR2_A_S))
#define MCPWM_CMPR2_A_V  0xFFFF
#define MCPWM_CMPR2_A_S  0

#define MCPWM_CMPR2_VALUE1_REG(i)          (REG_MCPWM_BASE(i) + 0xB4)
/* MCPWM_CMPR2_B : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: .*/
#define MCPWM_CMPR2_B    0x0000FFFF
#define MCPWM_CMPR2_B_M  ((MCPWM_CMPR2_B_V)<<(MCPWM_CMPR2_B_S))
#define MCPWM_CMPR2_B_V  0xFFFF
#define MCPWM_CMPR2_B_S  0

#define MCPWM_GEN2_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0xB8)
/* MCPWM_GEN2_T1_SEL : R/W ;bitpos:[9:7] ;default: 3'd0 ; */
/*description: take effect immediately, 0: extra0, 1: extra1, 2: extra2, 3: sync_taken, 4: none.*/
#define MCPWM_GEN2_T1_SEL    0x00000007
#define MCPWM_GEN2_T1_SEL_M  ((MCPWM_GEN2_T1_SEL_V)<<(MCPWM_GEN2_T1_SEL_S))
#define MCPWM_GEN2_T1_SEL_V  0x7
#define MCPWM_GEN2_T1_SEL_S  7
/* MCPWM_GEN2_T0_SEL : R/W ;bitpos:[6:4] ;default: 3'd0 ; */
/*description: take effect immediately, 0: extra0, 1: extra1, 2: extra2, 3: sync_taken, 4: none.*/
#define MCPWM_GEN2_T0_SEL    0x00000007
#define MCPWM_GEN2_T0_SEL_M  ((MCPWM_GEN2_T0_SEL_V)<<(MCPWM_GEN2_T0_SEL_S))
#define MCPWM_GEN2_T0_SEL_V  0x7
#define MCPWM_GEN2_T0_SEL_S  4
/* MCPWM_GEN2_CFG_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: 0: immediate, bit0: tez, bit1: tep, bit2: sync. bit3: freeze.*/
#define MCPWM_GEN2_CFG_UPMETHOD    0x0000000F
#define MCPWM_GEN2_CFG_UPMETHOD_M  ((MCPWM_GEN2_CFG_UPMETHOD_V)<<(MCPWM_GEN2_CFG_UPMETHOD_S))
#define MCPWM_GEN2_CFG_UPMETHOD_V  0xF
#define MCPWM_GEN2_CFG_UPMETHOD_S  0

#define MCPWM_GEN2_FORCE_REG(i)          (REG_MCPWM_BASE(i) + 0xBC)
/* MCPWM_GEN2_B_NCIFORCE_MODE : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: 0: disabled, 1: low, 2: high, 3: disabled.*/
#define MCPWM_GEN2_B_NCIFORCE_MODE    0x00000003
#define MCPWM_GEN2_B_NCIFORCE_MODE_M  ((MCPWM_GEN2_B_NCIFORCE_MODE_V)<<(MCPWM_GEN2_B_NCIFORCE_MODE_S))
#define MCPWM_GEN2_B_NCIFORCE_MODE_V  0x3
#define MCPWM_GEN2_B_NCIFORCE_MODE_S  14
/* MCPWM_GEN2_B_NCIFORCE : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: non-continuous immediate sw force, a toggle will trigger a force event.*/
#define MCPWM_GEN2_B_NCIFORCE    (BIT(13))
#define MCPWM_GEN2_B_NCIFORCE_M  (BIT(13))
#define MCPWM_GEN2_B_NCIFORCE_V  0x1
#define MCPWM_GEN2_B_NCIFORCE_S  13
/* MCPWM_GEN2_A_NCIFORCE_MODE : R/W ;bitpos:[12:11] ;default: 2'd0 ; */
/*description: 0: disabled, 1: low, 2: high, 3: disabled.*/
#define MCPWM_GEN2_A_NCIFORCE_MODE    0x00000003
#define MCPWM_GEN2_A_NCIFORCE_MODE_M  ((MCPWM_GEN2_A_NCIFORCE_MODE_V)<<(MCPWM_GEN2_A_NCIFORCE_MODE_S))
#define MCPWM_GEN2_A_NCIFORCE_MODE_V  0x3
#define MCPWM_GEN2_A_NCIFORCE_MODE_S  11
/* MCPWM_GEN2_A_NCIFORCE : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: non-continuous immediate sw force, a toggle will trigger a force event.*/
#define MCPWM_GEN2_A_NCIFORCE    (BIT(10))
#define MCPWM_GEN2_A_NCIFORCE_M  (BIT(10))
#define MCPWM_GEN2_A_NCIFORCE_V  0x1
#define MCPWM_GEN2_A_NCIFORCE_S  10
/* MCPWM_GEN2_B_CNTUFORCE_MODE : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: 0: disabled, 1: low, 2: high, 3: disabled.*/
#define MCPWM_GEN2_B_CNTUFORCE_MODE    0x00000003
#define MCPWM_GEN2_B_CNTUFORCE_MODE_M  ((MCPWM_GEN2_B_CNTUFORCE_MODE_V)<<(MCPWM_GEN2_B_CNTUFORCE_MODE_S))
#define MCPWM_GEN2_B_CNTUFORCE_MODE_V  0x3
#define MCPWM_GEN2_B_CNTUFORCE_MODE_S  8
/* MCPWM_GEN2_A_CNTUFORCE_MODE : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: 0: disabled, 1: low, 2: high, 3: disabled.*/
#define MCPWM_GEN2_A_CNTUFORCE_MODE    0x00000003
#define MCPWM_GEN2_A_CNTUFORCE_MODE_M  ((MCPWM_GEN2_A_CNTUFORCE_MODE_V)<<(MCPWM_GEN2_A_CNTUFORCE_MODE_S))
#define MCPWM_GEN2_A_CNTUFORCE_MODE_V  0x3
#define MCPWM_GEN2_A_CNTUFORCE_MODE_S  6
/* MCPWM_GEN2_CNTUFORCE_UPMETHOD : R/W ;bitpos:[5:0] ;default: 6'h20 ; */
/*description: 0: immediate, bit0: tez, bit1: tep, bit2: tea, bit3: teb, bit4: sync, bit5: free
ze.*/
#define MCPWM_GEN2_CNTUFORCE_UPMETHOD    0x0000003F
#define MCPWM_GEN2_CNTUFORCE_UPMETHOD_M  ((MCPWM_GEN2_CNTUFORCE_UPMETHOD_V)<<(MCPWM_GEN2_CNTUFORCE_UPMETHOD_S))
#define MCPWM_GEN2_CNTUFORCE_UPMETHOD_V  0x3F
#define MCPWM_GEN2_CNTUFORCE_UPMETHOD_S  0

