espressif/esp-idf/components/soc/esp32s3/include/soc/mcpwm_reg.h
#define MCPWM_GEN2_A_REG(i)          (REG_MCPWM_BASE(i) + 0xC0)
/* MCPWM_GEN2_A_DT1 : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: 0: no change, 1: low, 2: high, 3: toggle.*/
#define MCPWM_GEN2_A_DT1    0x00000003
#define MCPWM_GEN2_A_DT1_M  ((MCPWM_GEN2_A_DT1_V)<<(MCPWM_GEN2_A_DT1_S))
#define MCPWM_GEN2_A_DT1_V  0x3
#define MCPWM_GEN2_A_DT1_S  22
/* MCPWM_GEN2_A_DT0 : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_A_DT0    0x00000003
#define MCPWM_GEN2_A_DT0_M  ((MCPWM_GEN2_A_DT0_V)<<(MCPWM_GEN2_A_DT0_S))
#define MCPWM_GEN2_A_DT0_V  0x3
#define MCPWM_GEN2_A_DT0_S  20
/* MCPWM_GEN2_A_DTEB : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_A_DTEB    0x00000003
#define MCPWM_GEN2_A_DTEB_M  ((MCPWM_GEN2_A_DTEB_V)<<(MCPWM_GEN2_A_DTEB_S))
#define MCPWM_GEN2_A_DTEB_V  0x3
#define MCPWM_GEN2_A_DTEB_S  18
/* MCPWM_GEN2_A_DTEA : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_A_DTEA    0x00000003
#define MCPWM_GEN2_A_DTEA_M  ((MCPWM_GEN2_A_DTEA_V)<<(MCPWM_GEN2_A_DTEA_S))
#define MCPWM_GEN2_A_DTEA_V  0x3
#define MCPWM_GEN2_A_DTEA_S  16
/* MCPWM_GEN2_A_DTEP : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_A_DTEP    0x00000003
#define MCPWM_GEN2_A_DTEP_M  ((MCPWM_GEN2_A_DTEP_V)<<(MCPWM_GEN2_A_DTEP_S))
#define MCPWM_GEN2_A_DTEP_V  0x3
#define MCPWM_GEN2_A_DTEP_S  14
/* MCPWM_GEN2_A_DTEZ : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_A_DTEZ    0x00000003
#define MCPWM_GEN2_A_DTEZ_M  ((MCPWM_GEN2_A_DTEZ_V)<<(MCPWM_GEN2_A_DTEZ_S))
#define MCPWM_GEN2_A_DTEZ_V  0x3
#define MCPWM_GEN2_A_DTEZ_S  12
/* MCPWM_GEN2_A_UT1 : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_A_UT1    0x00000003
#define MCPWM_GEN2_A_UT1_M  ((MCPWM_GEN2_A_UT1_V)<<(MCPWM_GEN2_A_UT1_S))
#define MCPWM_GEN2_A_UT1_V  0x3
#define MCPWM_GEN2_A_UT1_S  10
/* MCPWM_GEN2_A_UT0 : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_A_UT0    0x00000003
#define MCPWM_GEN2_A_UT0_M  ((MCPWM_GEN2_A_UT0_V)<<(MCPWM_GEN2_A_UT0_S))
#define MCPWM_GEN2_A_UT0_V  0x3
#define MCPWM_GEN2_A_UT0_S  8
/* MCPWM_GEN2_A_UTEB : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_A_UTEB    0x00000003
#define MCPWM_GEN2_A_UTEB_M  ((MCPWM_GEN2_A_UTEB_V)<<(MCPWM_GEN2_A_UTEB_S))
#define MCPWM_GEN2_A_UTEB_V  0x3
#define MCPWM_GEN2_A_UTEB_S  6
/* MCPWM_GEN2_A_UTEA : R/W ;bitpos:[5:4] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_A_UTEA    0x00000003
#define MCPWM_GEN2_A_UTEA_M  ((MCPWM_GEN2_A_UTEA_V)<<(MCPWM_GEN2_A_UTEA_S))
#define MCPWM_GEN2_A_UTEA_V  0x3
#define MCPWM_GEN2_A_UTEA_S  4
/* MCPWM_GEN2_A_UTEP : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_A_UTEP    0x00000003
#define MCPWM_GEN2_A_UTEP_M  ((MCPWM_GEN2_A_UTEP_V)<<(MCPWM_GEN2_A_UTEP_S))
#define MCPWM_GEN2_A_UTEP_V  0x3
#define MCPWM_GEN2_A_UTEP_S  2
/* MCPWM_GEN2_A_UTEZ : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_A_UTEZ    0x00000003
#define MCPWM_GEN2_A_UTEZ_M  ((MCPWM_GEN2_A_UTEZ_V)<<(MCPWM_GEN2_A_UTEZ_S))
#define MCPWM_GEN2_A_UTEZ_V  0x3
#define MCPWM_GEN2_A_UTEZ_S  0

#define MCPWM_GEN2_B_REG(i)          (REG_MCPWM_BASE(i) + 0xC4)
/* MCPWM_GEN2_B_DT1 : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_B_DT1    0x00000003
#define MCPWM_GEN2_B_DT1_M  ((MCPWM_GEN2_B_DT1_V)<<(MCPWM_GEN2_B_DT1_S))
#define MCPWM_GEN2_B_DT1_V  0x3
#define MCPWM_GEN2_B_DT1_S  22
/* MCPWM_GEN2_B_DT0 : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_B_DT0    0x00000003
#define MCPWM_GEN2_B_DT0_M  ((MCPWM_GEN2_B_DT0_V)<<(MCPWM_GEN2_B_DT0_S))
#define MCPWM_GEN2_B_DT0_V  0x3
#define MCPWM_GEN2_B_DT0_S  20
/* MCPWM_GEN2_B_DTEB : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_B_DTEB    0x00000003
#define MCPWM_GEN2_B_DTEB_M  ((MCPWM_GEN2_B_DTEB_V)<<(MCPWM_GEN2_B_DTEB_S))
#define MCPWM_GEN2_B_DTEB_V  0x3
#define MCPWM_GEN2_B_DTEB_S  18
/* MCPWM_GEN2_B_DTEA : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_B_DTEA    0x00000003
#define MCPWM_GEN2_B_DTEA_M  ((MCPWM_GEN2_B_DTEA_V)<<(MCPWM_GEN2_B_DTEA_S))
#define MCPWM_GEN2_B_DTEA_V  0x3
#define MCPWM_GEN2_B_DTEA_S  16
/* MCPWM_GEN2_B_DTEP : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_B_DTEP    0x00000003
#define MCPWM_GEN2_B_DTEP_M  ((MCPWM_GEN2_B_DTEP_V)<<(MCPWM_GEN2_B_DTEP_S))
#define MCPWM_GEN2_B_DTEP_V  0x3
#define MCPWM_GEN2_B_DTEP_S  14
/* MCPWM_GEN2_B_DTEZ : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_B_DTEZ    0x00000003
#define MCPWM_GEN2_B_DTEZ_M  ((MCPWM_GEN2_B_DTEZ_V)<<(MCPWM_GEN2_B_DTEZ_S))
#define MCPWM_GEN2_B_DTEZ_V  0x3
#define MCPWM_GEN2_B_DTEZ_S  12
/* MCPWM_GEN2_B_UT1 : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_B_UT1    0x00000003
#define MCPWM_GEN2_B_UT1_M  ((MCPWM_GEN2_B_UT1_V)<<(MCPWM_GEN2_B_UT1_S))
#define MCPWM_GEN2_B_UT1_V  0x3
#define MCPWM_GEN2_B_UT1_S  10
/* MCPWM_GEN2_B_UT0 : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_B_UT0    0x00000003
#define MCPWM_GEN2_B_UT0_M  ((MCPWM_GEN2_B_UT0_V)<<(MCPWM_GEN2_B_UT0_S))
#define MCPWM_GEN2_B_UT0_V  0x3
#define MCPWM_GEN2_B_UT0_S  8
/* MCPWM_GEN2_B_UTEB : R/W ;bitpos:[7:6] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_B_UTEB    0x00000003
#define MCPWM_GEN2_B_UTEB_M  ((MCPWM_GEN2_B_UTEB_V)<<(MCPWM_GEN2_B_UTEB_S))
#define MCPWM_GEN2_B_UTEB_V  0x3
#define MCPWM_GEN2_B_UTEB_S  6
/* MCPWM_GEN2_B_UTEA : R/W ;bitpos:[5:4] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_B_UTEA    0x00000003
#define MCPWM_GEN2_B_UTEA_M  ((MCPWM_GEN2_B_UTEA_V)<<(MCPWM_GEN2_B_UTEA_S))
#define MCPWM_GEN2_B_UTEA_V  0x3
#define MCPWM_GEN2_B_UTEA_S  4
/* MCPWM_GEN2_B_UTEP : R/W ;bitpos:[3:2] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_B_UTEP    0x00000003
#define MCPWM_GEN2_B_UTEP_M  ((MCPWM_GEN2_B_UTEP_V)<<(MCPWM_GEN2_B_UTEP_S))
#define MCPWM_GEN2_B_UTEP_V  0x3
#define MCPWM_GEN2_B_UTEP_S  2
/* MCPWM_GEN2_B_UTEZ : R/W ;bitpos:[1:0] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_GEN2_B_UTEZ    0x00000003
#define MCPWM_GEN2_B_UTEZ_M  ((MCPWM_GEN2_B_UTEZ_V)<<(MCPWM_GEN2_B_UTEZ_S))
#define MCPWM_GEN2_B_UTEZ_V  0x3
#define MCPWM_GEN2_B_UTEZ_S  0

#define MCPWM_DB2_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0xC8)
/* MCPWM_DB2_CLK_SEL : R/W ;bitpos:[17] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB2_CLK_SEL    (BIT(17))
#define MCPWM_DB2_CLK_SEL_M  (BIT(17))
#define MCPWM_DB2_CLK_SEL_V  0x1
#define MCPWM_DB2_CLK_SEL_S  17
/* MCPWM_DB2_B_OUTBYPASS : R/W ;bitpos:[16] ;default: 1'd1 ; */
/*description: .*/
#define MCPWM_DB2_B_OUTBYPASS    (BIT(16))
#define MCPWM_DB2_B_OUTBYPASS_M  (BIT(16))
#define MCPWM_DB2_B_OUTBYPASS_V  0x1
#define MCPWM_DB2_B_OUTBYPASS_S  16
/* MCPWM_DB2_A_OUTBYPASS : R/W ;bitpos:[15] ;default: 1'd1 ; */
/*description: .*/
#define MCPWM_DB2_A_OUTBYPASS    (BIT(15))
#define MCPWM_DB2_A_OUTBYPASS_M  (BIT(15))
#define MCPWM_DB2_A_OUTBYPASS_V  0x1
#define MCPWM_DB2_A_OUTBYPASS_S  15
/* MCPWM_DB2_FED_OUTINVERT : R/W ;bitpos:[14] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB2_FED_OUTINVERT    (BIT(14))
#define MCPWM_DB2_FED_OUTINVERT_M  (BIT(14))
#define MCPWM_DB2_FED_OUTINVERT_V  0x1
#define MCPWM_DB2_FED_OUTINVERT_S  14
/* MCPWM_DB2_RED_OUTINVERT : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB2_RED_OUTINVERT    (BIT(13))
#define MCPWM_DB2_RED_OUTINVERT_M  (BIT(13))
#define MCPWM_DB2_RED_OUTINVERT_V  0x1
#define MCPWM_DB2_RED_OUTINVERT_S  13
/* MCPWM_DB2_FED_INSEL : R/W ;bitpos:[12] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB2_FED_INSEL    (BIT(12))
#define MCPWM_DB2_FED_INSEL_M  (BIT(12))
#define MCPWM_DB2_FED_INSEL_V  0x1
#define MCPWM_DB2_FED_INSEL_S  12
/* MCPWM_DB2_RED_INSEL : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB2_RED_INSEL    (BIT(11))
#define MCPWM_DB2_RED_INSEL_M  (BIT(11))
#define MCPWM_DB2_RED_INSEL_V  0x1
#define MCPWM_DB2_RED_INSEL_S  11
/* MCPWM_DB2_B_OUTSWAP : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB2_B_OUTSWAP    (BIT(10))
#define MCPWM_DB2_B_OUTSWAP_M  (BIT(10))
#define MCPWM_DB2_B_OUTSWAP_V  0x1
#define MCPWM_DB2_B_OUTSWAP_S  10
/* MCPWM_DB2_A_OUTSWAP : R/W ;bitpos:[9] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB2_A_OUTSWAP    (BIT(9))
#define MCPWM_DB2_A_OUTSWAP_M  (BIT(9))
#define MCPWM_DB2_A_OUTSWAP_V  0x1
#define MCPWM_DB2_A_OUTSWAP_S  9
/* MCPWM_DB2_DEB_MODE : R/W ;bitpos:[8] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_DB2_DEB_MODE    (BIT(8))
#define MCPWM_DB2_DEB_MODE_M  (BIT(8))
#define MCPWM_DB2_DEB_MODE_V  0x1
#define MCPWM_DB2_DEB_MODE_S  8
/* MCPWM_DB2_RED_UPMETHOD : R/W ;bitpos:[7:4] ;default: 4'd0 ; */
/*description: .*/
#define MCPWM_DB2_RED_UPMETHOD    0x0000000F
#define MCPWM_DB2_RED_UPMETHOD_M  ((MCPWM_DB2_RED_UPMETHOD_V)<<(MCPWM_DB2_RED_UPMETHOD_S))
#define MCPWM_DB2_RED_UPMETHOD_V  0xF
#define MCPWM_DB2_RED_UPMETHOD_S  4
/* MCPWM_DB2_FED_UPMETHOD : R/W ;bitpos:[3:0] ;default: 4'd0 ; */
/*description: .*/
#define MCPWM_DB2_FED_UPMETHOD    0x0000000F
#define MCPWM_DB2_FED_UPMETHOD_M  ((MCPWM_DB2_FED_UPMETHOD_V)<<(MCPWM_DB2_FED_UPMETHOD_S))
#define MCPWM_DB2_FED_UPMETHOD_V  0xF
#define MCPWM_DB2_FED_UPMETHOD_S  0

#define MCPWM_DB2_FED_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0xCC)
/* MCPWM_DB2_FED : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: .*/
#define MCPWM_DB2_FED    0x0000FFFF
#define MCPWM_DB2_FED_M  ((MCPWM_DB2_FED_V)<<(MCPWM_DB2_FED_S))
#define MCPWM_DB2_FED_V  0xFFFF
#define MCPWM_DB2_FED_S  0

#define MCPWM_DB2_RED_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0xD0)
/* MCPWM_DB2_RED : R/W ;bitpos:[15:0] ;default: 16'd0 ; */
/*description: .*/
#define MCPWM_DB2_RED    0x0000FFFF
#define MCPWM_DB2_RED_M  ((MCPWM_DB2_RED_V)<<(MCPWM_DB2_RED_S))
#define MCPWM_DB2_RED_V  0xFFFF
#define MCPWM_DB2_RED_S  0

#define MCPWM_CHOPPER2_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0xD4)
/* MCPWM_CHOPPER2_IN_INVERT : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CHOPPER2_IN_INVERT    (BIT(13))
#define MCPWM_CHOPPER2_IN_INVERT_M  (BIT(13))
#define MCPWM_CHOPPER2_IN_INVERT_V  0x1
#define MCPWM_CHOPPER2_IN_INVERT_S  13
/* MCPWM_CHOPPER2_OUT_INVERT : R/W ;bitpos:[12] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CHOPPER2_OUT_INVERT    (BIT(12))
#define MCPWM_CHOPPER2_OUT_INVERT_M  (BIT(12))
#define MCPWM_CHOPPER2_OUT_INVERT_V  0x1
#define MCPWM_CHOPPER2_OUT_INVERT_S  12
/* MCPWM_CHOPPER2_OSHTWTH : R/W ;bitpos:[11:8] ;default: 4'd0 ; */
/*description: .*/
#define MCPWM_CHOPPER2_OSHTWTH    0x0000000F
#define MCPWM_CHOPPER2_OSHTWTH_M  ((MCPWM_CHOPPER2_OSHTWTH_V)<<(MCPWM_CHOPPER2_OSHTWTH_S))
#define MCPWM_CHOPPER2_OSHTWTH_V  0xF
#define MCPWM_CHOPPER2_OSHTWTH_S  8
/* MCPWM_CHOPPER2_DUTY : R/W ;bitpos:[7:5] ;default: 3'd0 ; */
/*description: .*/
#define MCPWM_CHOPPER2_DUTY    0x00000007
#define MCPWM_CHOPPER2_DUTY_M  ((MCPWM_CHOPPER2_DUTY_V)<<(MCPWM_CHOPPER2_DUTY_S))
#define MCPWM_CHOPPER2_DUTY_V  0x7
#define MCPWM_CHOPPER2_DUTY_S  5
/* MCPWM_CHOPPER2_PRESCALE : R/W ;bitpos:[4:1] ;default: 4'd0 ; */
/*description: .*/
#define MCPWM_CHOPPER2_PRESCALE    0x0000000F
#define MCPWM_CHOPPER2_PRESCALE_M  ((MCPWM_CHOPPER2_PRESCALE_V)<<(MCPWM_CHOPPER2_PRESCALE_S))
#define MCPWM_CHOPPER2_PRESCALE_V  0xF
#define MCPWM_CHOPPER2_PRESCALE_S  1
/* MCPWM_CHOPPER2_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CHOPPER2_EN    (BIT(0))
#define MCPWM_CHOPPER2_EN_M  (BIT(0))
#define MCPWM_CHOPPER2_EN_V  0x1
#define MCPWM_CHOPPER2_EN_S  0

#define MCPWM_TZ2_CFG0_REG(i)          (REG_MCPWM_BASE(i) + 0xD8)
/* MCPWM_TZ2_B_OST_U : R/W ;bitpos:[23:22] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ2_B_OST_U    0x00000003
#define MCPWM_TZ2_B_OST_U_M  ((MCPWM_TZ2_B_OST_U_V)<<(MCPWM_TZ2_B_OST_U_S))
#define MCPWM_TZ2_B_OST_U_V  0x3
#define MCPWM_TZ2_B_OST_U_S  22
/* MCPWM_TZ2_B_OST_D : R/W ;bitpos:[21:20] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ2_B_OST_D    0x00000003
#define MCPWM_TZ2_B_OST_D_M  ((MCPWM_TZ2_B_OST_D_V)<<(MCPWM_TZ2_B_OST_D_S))
#define MCPWM_TZ2_B_OST_D_V  0x3
#define MCPWM_TZ2_B_OST_D_S  20
/* MCPWM_TZ2_B_CBC_U : R/W ;bitpos:[19:18] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ2_B_CBC_U    0x00000003
#define MCPWM_TZ2_B_CBC_U_M  ((MCPWM_TZ2_B_CBC_U_V)<<(MCPWM_TZ2_B_CBC_U_S))
#define MCPWM_TZ2_B_CBC_U_V  0x3
#define MCPWM_TZ2_B_CBC_U_S  18
/* MCPWM_TZ2_B_CBC_D : R/W ;bitpos:[17:16] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ2_B_CBC_D    0x00000003
#define MCPWM_TZ2_B_CBC_D_M  ((MCPWM_TZ2_B_CBC_D_V)<<(MCPWM_TZ2_B_CBC_D_S))
#define MCPWM_TZ2_B_CBC_D_V  0x3
#define MCPWM_TZ2_B_CBC_D_S  16
/* MCPWM_TZ2_A_OST_U : R/W ;bitpos:[15:14] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ2_A_OST_U    0x00000003
#define MCPWM_TZ2_A_OST_U_M  ((MCPWM_TZ2_A_OST_U_V)<<(MCPWM_TZ2_A_OST_U_S))
#define MCPWM_TZ2_A_OST_U_V  0x3
#define MCPWM_TZ2_A_OST_U_S  14
/* MCPWM_TZ2_A_OST_D : R/W ;bitpos:[13:12] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ2_A_OST_D    0x00000003
#define MCPWM_TZ2_A_OST_D_M  ((MCPWM_TZ2_A_OST_D_V)<<(MCPWM_TZ2_A_OST_D_S))
#define MCPWM_TZ2_A_OST_D_V  0x3
#define MCPWM_TZ2_A_OST_D_S  12
/* MCPWM_TZ2_A_CBC_U : R/W ;bitpos:[11:10] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ2_A_CBC_U    0x00000003
#define MCPWM_TZ2_A_CBC_U_M  ((MCPWM_TZ2_A_CBC_U_V)<<(MCPWM_TZ2_A_CBC_U_S))
#define MCPWM_TZ2_A_CBC_U_V  0x3
#define MCPWM_TZ2_A_CBC_U_S  10
/* MCPWM_TZ2_A_CBC_D : R/W ;bitpos:[9:8] ;default: 2'd0 ; */
/*description: 0: do nothing, 1: force lo, 2: force hi, 3: toggle.*/
#define MCPWM_TZ2_A_CBC_D    0x00000003
#define MCPWM_TZ2_A_CBC_D_M  ((MCPWM_TZ2_A_CBC_D_V)<<(MCPWM_TZ2_A_CBC_D_S))
#define MCPWM_TZ2_A_CBC_D_V  0x3
#define MCPWM_TZ2_A_CBC_D_S  8
/* MCPWM_TZ2_F0_OST : R/W ;bitpos:[7] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ2_F0_OST    (BIT(7))
#define MCPWM_TZ2_F0_OST_M  (BIT(7))
#define MCPWM_TZ2_F0_OST_V  0x1
#define MCPWM_TZ2_F0_OST_S  7
/* MCPWM_TZ2_F1_OST : R/W ;bitpos:[6] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ2_F1_OST    (BIT(6))
#define MCPWM_TZ2_F1_OST_M  (BIT(6))
#define MCPWM_TZ2_F1_OST_V  0x1
#define MCPWM_TZ2_F1_OST_S  6
/* MCPWM_TZ2_F2_OST : R/W ;bitpos:[5] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ2_F2_OST    (BIT(5))
#define MCPWM_TZ2_F2_OST_M  (BIT(5))
#define MCPWM_TZ2_F2_OST_V  0x1
#define MCPWM_TZ2_F2_OST_S  5
/* MCPWM_TZ2_SW_OST : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ2_SW_OST    (BIT(4))
#define MCPWM_TZ2_SW_OST_M  (BIT(4))
#define MCPWM_TZ2_SW_OST_V  0x1
#define MCPWM_TZ2_SW_OST_S  4
/* MCPWM_TZ2_F0_CBC : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ2_F0_CBC    (BIT(3))
#define MCPWM_TZ2_F0_CBC_M  (BIT(3))
#define MCPWM_TZ2_F0_CBC_V  0x1
#define MCPWM_TZ2_F0_CBC_S  3
/* MCPWM_TZ2_F1_CBC : R/W ;bitpos:[2] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ2_F1_CBC    (BIT(2))
#define MCPWM_TZ2_F1_CBC_M  (BIT(2))
#define MCPWM_TZ2_F1_CBC_V  0x1
#define MCPWM_TZ2_F1_CBC_S  2
/* MCPWM_TZ2_F2_CBC : R/W ;bitpos:[1] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ2_F2_CBC    (BIT(1))
#define MCPWM_TZ2_F2_CBC_M  (BIT(1))
#define MCPWM_TZ2_F2_CBC_V  0x1
#define MCPWM_TZ2_F2_CBC_S  1
/* MCPWM_TZ2_SW_CBC : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: 0: disable, 1: enable.*/
#define MCPWM_TZ2_SW_CBC    (BIT(0))
#define MCPWM_TZ2_SW_CBC_M  (BIT(0))
#define MCPWM_TZ2_SW_CBC_V  0x1
#define MCPWM_TZ2_SW_CBC_S  0

#define MCPWM_TZ2_CFG1_REG(i)          (REG_MCPWM_BASE(i) + 0xDC)
/* MCPWM_TZ2_FORCE_OST : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: a toggle trigger a oneshot tripping.*/
#define MCPWM_TZ2_FORCE_OST    (BIT(4))
#define MCPWM_TZ2_FORCE_OST_M  (BIT(4))
#define MCPWM_TZ2_FORCE_OST_V  0x1
#define MCPWM_TZ2_FORCE_OST_S  4
/* MCPWM_TZ2_FORCE_CBC : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: a toggle trigger a cycle-by-cycle tripping.*/
#define MCPWM_TZ2_FORCE_CBC    (BIT(3))
#define MCPWM_TZ2_FORCE_CBC_M  (BIT(3))
#define MCPWM_TZ2_FORCE_CBC_V  0x1
#define MCPWM_TZ2_FORCE_CBC_S  3
/* MCPWM_TZ2_CBCPULSE : R/W ;bitpos:[2:1] ;default: 2'd0 ; */
/*description: bit0: tez, bit1: tep.*/
#define MCPWM_TZ2_CBCPULSE    0x00000003
#define MCPWM_TZ2_CBCPULSE_M  ((MCPWM_TZ2_CBCPULSE_V)<<(MCPWM_TZ2_CBCPULSE_S))
#define MCPWM_TZ2_CBCPULSE_V  0x3
#define MCPWM_TZ2_CBCPULSE_S  1
/* MCPWM_TZ2_CLR_OST : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: a toggle will clear oneshot tripping.*/
#define MCPWM_TZ2_CLR_OST    (BIT(0))
#define MCPWM_TZ2_CLR_OST_M  (BIT(0))
#define MCPWM_TZ2_CLR_OST_V  0x1
#define MCPWM_TZ2_CLR_OST_S  0

