espressif/esp-idf/components/soc/esp32s3/include/soc/mcpwm_reg.h
#define MCPWM_TZ2_STATUS_REG(i)          (REG_MCPWM_BASE(i) + 0xE0)
/* MCPWM_TZ2_OST_ON : RO ;bitpos:[1] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ2_OST_ON    (BIT(1))
#define MCPWM_TZ2_OST_ON_M  (BIT(1))
#define MCPWM_TZ2_OST_ON_V  0x1
#define MCPWM_TZ2_OST_ON_S  1
/* MCPWM_TZ2_CBC_ON : RO ;bitpos:[0] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ2_CBC_ON    (BIT(0))
#define MCPWM_TZ2_CBC_ON_M  (BIT(0))
#define MCPWM_TZ2_CBC_ON_V  0x1
#define MCPWM_TZ2_CBC_ON_S  0

#define MCPWM_FAULT_DETECT_REG(i)          (REG_MCPWM_BASE(i) + 0xE4)
/* MCPWM_EVENT_F2 : RO ;bitpos:[8] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_EVENT_F2    (BIT(8))
#define MCPWM_EVENT_F2_M  (BIT(8))
#define MCPWM_EVENT_F2_V  0x1
#define MCPWM_EVENT_F2_S  8
/* MCPWM_EVENT_F1 : RO ;bitpos:[7] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_EVENT_F1    (BIT(7))
#define MCPWM_EVENT_F1_M  (BIT(7))
#define MCPWM_EVENT_F1_V  0x1
#define MCPWM_EVENT_F1_S  7
/* MCPWM_EVENT_F0 : RO ;bitpos:[6] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_EVENT_F0    (BIT(6))
#define MCPWM_EVENT_F0_M  (BIT(6))
#define MCPWM_EVENT_F0_V  0x1
#define MCPWM_EVENT_F0_S  6
/* MCPWM_F2_POLE : R/W ;bitpos:[5] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_F2_POLE    (BIT(5))
#define MCPWM_F2_POLE_M  (BIT(5))
#define MCPWM_F2_POLE_V  0x1
#define MCPWM_F2_POLE_S  5
/* MCPWM_F1_POLE : R/W ;bitpos:[4] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_F1_POLE    (BIT(4))
#define MCPWM_F1_POLE_M  (BIT(4))
#define MCPWM_F1_POLE_V  0x1
#define MCPWM_F1_POLE_S  4
/* MCPWM_F0_POLE : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_F0_POLE    (BIT(3))
#define MCPWM_F0_POLE_M  (BIT(3))
#define MCPWM_F0_POLE_V  0x1
#define MCPWM_F0_POLE_S  3
/* MCPWM_F2_EN : R/W ;bitpos:[2] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_F2_EN    (BIT(2))
#define MCPWM_F2_EN_M  (BIT(2))
#define MCPWM_F2_EN_V  0x1
#define MCPWM_F2_EN_S  2
/* MCPWM_F1_EN : R/W ;bitpos:[1] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_F1_EN    (BIT(1))
#define MCPWM_F1_EN_M  (BIT(1))
#define MCPWM_F1_EN_V  0x1
#define MCPWM_F1_EN_S  1
/* MCPWM_F0_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_F0_EN    (BIT(0))
#define MCPWM_F0_EN_M  (BIT(0))
#define MCPWM_F0_EN_V  0x1
#define MCPWM_F0_EN_S  0

#define MCPWM_CAP_TIMER_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0xE8)
/* MCPWM_CAP_SYNC_SW : WO ;bitpos:[5] ;default: 1'd0 ; */
/*description: Write 1 will force a timer sync.*/
#define MCPWM_CAP_SYNC_SW    (BIT(5))
#define MCPWM_CAP_SYNC_SW_M  (BIT(5))
#define MCPWM_CAP_SYNC_SW_V  0x1
#define MCPWM_CAP_SYNC_SW_S  5
/* MCPWM_CAP_SYNCI_SEL : R/W ;bitpos:[4:2] ;default: 3'd0 ; */
/*description: .*/
#define MCPWM_CAP_SYNCI_SEL    0x00000007
#define MCPWM_CAP_SYNCI_SEL_M  ((MCPWM_CAP_SYNCI_SEL_V)<<(MCPWM_CAP_SYNCI_SEL_S))
#define MCPWM_CAP_SYNCI_SEL_V  0x7
#define MCPWM_CAP_SYNCI_SEL_S  2
/* MCPWM_CAP_SYNCI_EN : R/W ;bitpos:[1] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP_SYNCI_EN    (BIT(1))
#define MCPWM_CAP_SYNCI_EN_M  (BIT(1))
#define MCPWM_CAP_SYNCI_EN_V  0x1
#define MCPWM_CAP_SYNCI_EN_S  1
/* MCPWM_CAP_TIMER_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP_TIMER_EN    (BIT(0))
#define MCPWM_CAP_TIMER_EN_M  (BIT(0))
#define MCPWM_CAP_TIMER_EN_V  0x1
#define MCPWM_CAP_TIMER_EN_S  0

#define MCPWM_CAP_TIMER_PHASE_REG(i)          (REG_MCPWM_BASE(i) + 0xEC)
/* MCPWM_CAP_PHASE : R/W ;bitpos:[31:0] ;default: 32'd0 ; */
/*description: .*/
#define MCPWM_CAP_PHASE    0xFFFFFFFF
#define MCPWM_CAP_PHASE_M  ((MCPWM_CAP_PHASE_V)<<(MCPWM_CAP_PHASE_S))
#define MCPWM_CAP_PHASE_V  0xFFFFFFFF
#define MCPWM_CAP_PHASE_S  0

#define MCPWM_CAP_CH0_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0xF0)
/* MCPWM_CAP0_SW : WO ;bitpos:[12] ;default: 1'd0 ; */
/*description: Write 1 will trigger a sw capture.*/
#define MCPWM_CAP0_SW    (BIT(12))
#define MCPWM_CAP0_SW_M  (BIT(12))
#define MCPWM_CAP0_SW_V  0x1
#define MCPWM_CAP0_SW_S  12
/* MCPWM_CAP0_IN_INVERT : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP0_IN_INVERT    (BIT(11))
#define MCPWM_CAP0_IN_INVERT_M  (BIT(11))
#define MCPWM_CAP0_IN_INVERT_V  0x1
#define MCPWM_CAP0_IN_INVERT_S  11
/* MCPWM_CAP0_PRESCALE : R/W ;bitpos:[10:3] ;default: 8'd0 ; */
/*description: .*/
#define MCPWM_CAP0_PRESCALE    0x000000FF
#define MCPWM_CAP0_PRESCALE_M  ((MCPWM_CAP0_PRESCALE_V)<<(MCPWM_CAP0_PRESCALE_S))
#define MCPWM_CAP0_PRESCALE_V  0xFF
#define MCPWM_CAP0_PRESCALE_S  3
/* MCPWM_CAP0_MODE : R/W ;bitpos:[2:1] ;default: 2'd0 ; */
/*description: bit0: negedge cap en, bit1: posedge cap en.*/
#define MCPWM_CAP0_MODE    0x00000003
#define MCPWM_CAP0_MODE_M  ((MCPWM_CAP0_MODE_V)<<(MCPWM_CAP0_MODE_S))
#define MCPWM_CAP0_MODE_V  0x3
#define MCPWM_CAP0_MODE_S  1
/* MCPWM_CAP0_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP0_EN    (BIT(0))
#define MCPWM_CAP0_EN_M  (BIT(0))
#define MCPWM_CAP0_EN_V  0x1
#define MCPWM_CAP0_EN_S  0

#define MCPWM_CAP_CH1_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0xF4)
/* MCPWM_CAP1_SW : WO ;bitpos:[12] ;default: 1'd0 ; */
/*description: Write 1 will trigger a sw capture.*/
#define MCPWM_CAP1_SW    (BIT(12))
#define MCPWM_CAP1_SW_M  (BIT(12))
#define MCPWM_CAP1_SW_V  0x1
#define MCPWM_CAP1_SW_S  12
/* MCPWM_CAP1_IN_INVERT : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP1_IN_INVERT    (BIT(11))
#define MCPWM_CAP1_IN_INVERT_M  (BIT(11))
#define MCPWM_CAP1_IN_INVERT_V  0x1
#define MCPWM_CAP1_IN_INVERT_S  11
/* MCPWM_CAP1_PRESCALE : R/W ;bitpos:[10:3] ;default: 8'd0 ; */
/*description: .*/
#define MCPWM_CAP1_PRESCALE    0x000000FF
#define MCPWM_CAP1_PRESCALE_M  ((MCPWM_CAP1_PRESCALE_V)<<(MCPWM_CAP1_PRESCALE_S))
#define MCPWM_CAP1_PRESCALE_V  0xFF
#define MCPWM_CAP1_PRESCALE_S  3
/* MCPWM_CAP1_MODE : R/W ;bitpos:[2:1] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_CAP1_MODE    0x00000003
#define MCPWM_CAP1_MODE_M  ((MCPWM_CAP1_MODE_V)<<(MCPWM_CAP1_MODE_S))
#define MCPWM_CAP1_MODE_V  0x3
#define MCPWM_CAP1_MODE_S  1
/* MCPWM_CAP1_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP1_EN    (BIT(0))
#define MCPWM_CAP1_EN_M  (BIT(0))
#define MCPWM_CAP1_EN_V  0x1
#define MCPWM_CAP1_EN_S  0

#define MCPWM_CAP_CH2_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0xF8)
/* MCPWM_CAP2_SW : WO ;bitpos:[12] ;default: 1'd0 ; */
/*description: Write 1 will trigger a sw capture.*/
#define MCPWM_CAP2_SW    (BIT(12))
#define MCPWM_CAP2_SW_M  (BIT(12))
#define MCPWM_CAP2_SW_V  0x1
#define MCPWM_CAP2_SW_S  12
/* MCPWM_CAP2_IN_INVERT : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP2_IN_INVERT    (BIT(11))
#define MCPWM_CAP2_IN_INVERT_M  (BIT(11))
#define MCPWM_CAP2_IN_INVERT_V  0x1
#define MCPWM_CAP2_IN_INVERT_S  11
/* MCPWM_CAP2_PRESCALE : R/W ;bitpos:[10:3] ;default: 8'd0 ; */
/*description: .*/
#define MCPWM_CAP2_PRESCALE    0x000000FF
#define MCPWM_CAP2_PRESCALE_M  ((MCPWM_CAP2_PRESCALE_V)<<(MCPWM_CAP2_PRESCALE_S))
#define MCPWM_CAP2_PRESCALE_V  0xFF
#define MCPWM_CAP2_PRESCALE_S  3
/* MCPWM_CAP2_MODE : R/W ;bitpos:[2:1] ;default: 2'd0 ; */
/*description: .*/
#define MCPWM_CAP2_MODE    0x00000003
#define MCPWM_CAP2_MODE_M  ((MCPWM_CAP2_MODE_V)<<(MCPWM_CAP2_MODE_S))
#define MCPWM_CAP2_MODE_V  0x3
#define MCPWM_CAP2_MODE_S  1
/* MCPWM_CAP2_EN : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP2_EN    (BIT(0))
#define MCPWM_CAP2_EN_M  (BIT(0))
#define MCPWM_CAP2_EN_V  0x1
#define MCPWM_CAP2_EN_S  0

#define MCPWM_CAP_CH0_REG(i)          (REG_MCPWM_BASE(i) + 0xFC)
/* MCPWM_CAP0_VALUE : RO ;bitpos:[31:0] ;default: 32'd0 ; */
/*description: .*/
#define MCPWM_CAP0_VALUE    0xFFFFFFFF
#define MCPWM_CAP0_VALUE_M  ((MCPWM_CAP0_VALUE_V)<<(MCPWM_CAP0_VALUE_S))
#define MCPWM_CAP0_VALUE_V  0xFFFFFFFF
#define MCPWM_CAP0_VALUE_S  0

