espressif/esp-idf/components/soc/esp32s3/include/soc/mcpwm_reg.h
#define MCPWM_CAP_CH1_REG(i)          (REG_MCPWM_BASE(i) + 0x100)
/* MCPWM_CAP1_VALUE : RO ;bitpos:[31:0] ;default: 32'd0 ; */
/*description: .*/
#define MCPWM_CAP1_VALUE    0xFFFFFFFF
#define MCPWM_CAP1_VALUE_M  ((MCPWM_CAP1_VALUE_V)<<(MCPWM_CAP1_VALUE_S))
#define MCPWM_CAP1_VALUE_V  0xFFFFFFFF
#define MCPWM_CAP1_VALUE_S  0

#define MCPWM_CAP_CH2_REG(i)          (REG_MCPWM_BASE(i) + 0x104)
/* MCPWM_CAP2_VALUE : RO ;bitpos:[31:0] ;default: 32'd0 ; */
/*description: .*/
#define MCPWM_CAP2_VALUE    0xFFFFFFFF
#define MCPWM_CAP2_VALUE_M  ((MCPWM_CAP2_VALUE_V)<<(MCPWM_CAP2_VALUE_S))
#define MCPWM_CAP2_VALUE_V  0xFFFFFFFF
#define MCPWM_CAP2_VALUE_S  0

#define MCPWM_CAP_STATUS_REG(i)          (REG_MCPWM_BASE(i) + 0x108)
/* MCPWM_CAP2_EDGE : RO ;bitpos:[2] ;default: 1'd0 ; */
/*description: cap trigger's edge, 0: posedge, 1: negedge.*/
#define MCPWM_CAP2_EDGE    (BIT(2))
#define MCPWM_CAP2_EDGE_M  (BIT(2))
#define MCPWM_CAP2_EDGE_V  0x1
#define MCPWM_CAP2_EDGE_S  2
/* MCPWM_CAP1_EDGE : RO ;bitpos:[1] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP1_EDGE    (BIT(1))
#define MCPWM_CAP1_EDGE_M  (BIT(1))
#define MCPWM_CAP1_EDGE_V  0x1
#define MCPWM_CAP1_EDGE_S  1
/* MCPWM_CAP0_EDGE : RO ;bitpos:[0] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP0_EDGE    (BIT(0))
#define MCPWM_CAP0_EDGE_M  (BIT(0))
#define MCPWM_CAP0_EDGE_V  0x1
#define MCPWM_CAP0_EDGE_S  0

#define MCPWM_UPDATE_CFG_REG(i)          (REG_MCPWM_BASE(i) + 0x10C)
/* MCPWM_OP2_FORCE_UP : R/W ;bitpos:[7] ;default: 1'd0 ; */
/*description: a toggle will trigger a force update.*/
#define MCPWM_OP2_FORCE_UP    (BIT(7))
#define MCPWM_OP2_FORCE_UP_M  (BIT(7))
#define MCPWM_OP2_FORCE_UP_V  0x1
#define MCPWM_OP2_FORCE_UP_S  7
/* MCPWM_OP2_UP_EN : R/W ;bitpos:[6] ;default: 1'd1 ; */
/*description: reg update local enable.*/
#define MCPWM_OP2_UP_EN    (BIT(6))
#define MCPWM_OP2_UP_EN_M  (BIT(6))
#define MCPWM_OP2_UP_EN_V  0x1
#define MCPWM_OP2_UP_EN_S  6
/* MCPWM_OP1_FORCE_UP : R/W ;bitpos:[5] ;default: 1'd0 ; */
/*description: a toggle will trigger a force update.*/
#define MCPWM_OP1_FORCE_UP    (BIT(5))
#define MCPWM_OP1_FORCE_UP_M  (BIT(5))
#define MCPWM_OP1_FORCE_UP_V  0x1
#define MCPWM_OP1_FORCE_UP_S  5
/* MCPWM_OP1_UP_EN : R/W ;bitpos:[4] ;default: 1'd1 ; */
/*description: .*/
#define MCPWM_OP1_UP_EN    (BIT(4))
#define MCPWM_OP1_UP_EN_M  (BIT(4))
#define MCPWM_OP1_UP_EN_V  0x1
#define MCPWM_OP1_UP_EN_S  4
/* MCPWM_OP0_FORCE_UP : R/W ;bitpos:[3] ;default: 1'd0 ; */
/*description: a toggle will trigger a force update.*/
#define MCPWM_OP0_FORCE_UP    (BIT(3))
#define MCPWM_OP0_FORCE_UP_M  (BIT(3))
#define MCPWM_OP0_FORCE_UP_V  0x1
#define MCPWM_OP0_FORCE_UP_S  3
/* MCPWM_OP0_UP_EN : R/W ;bitpos:[2] ;default: 1'd1 ; */
/*description: .*/
#define MCPWM_OP0_UP_EN    (BIT(2))
#define MCPWM_OP0_UP_EN_M  (BIT(2))
#define MCPWM_OP0_UP_EN_V  0x1
#define MCPWM_OP0_UP_EN_S  2
/* MCPWM_GLOBAL_FORCE_UP : R/W ;bitpos:[1] ;default: 1'd0 ; */
/*description: a toggle will trigger a force update, all timers and operators will update their
 active regs.*/
#define MCPWM_GLOBAL_FORCE_UP    (BIT(1))
#define MCPWM_GLOBAL_FORCE_UP_M  (BIT(1))
#define MCPWM_GLOBAL_FORCE_UP_V  0x1
#define MCPWM_GLOBAL_FORCE_UP_S  1
/* MCPWM_GLOBAL_UP_EN : R/W ;bitpos:[0] ;default: 1'd1 ; */
/*description: .*/
#define MCPWM_GLOBAL_UP_EN    (BIT(0))
#define MCPWM_GLOBAL_UP_EN_M  (BIT(0))
#define MCPWM_GLOBAL_UP_EN_V  0x1
#define MCPWM_GLOBAL_UP_EN_S  0

#define MCPWM_INT_ENA_PWM_REG(i)          (REG_MCPWM_BASE(i) + 0x110)
/* MCPWM_CAP2_INT_ENA : R/W ;bitpos:[29] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP2_INT_ENA    (BIT(29))
#define MCPWM_CAP2_INT_ENA_M  (BIT(29))
#define MCPWM_CAP2_INT_ENA_V  0x1
#define MCPWM_CAP2_INT_ENA_S  29
/* MCPWM_CAP1_INT_ENA : R/W ;bitpos:[28] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP1_INT_ENA    (BIT(28))
#define MCPWM_CAP1_INT_ENA_M  (BIT(28))
#define MCPWM_CAP1_INT_ENA_V  0x1
#define MCPWM_CAP1_INT_ENA_S  28
/* MCPWM_CAP0_INT_ENA : R/W ;bitpos:[27] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP0_INT_ENA    (BIT(27))
#define MCPWM_CAP0_INT_ENA_M  (BIT(27))
#define MCPWM_CAP0_INT_ENA_V  0x1
#define MCPWM_CAP0_INT_ENA_S  27
/* MCPWM_TZ2_OST_INT_ENA : R/W ;bitpos:[26] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ2_OST_INT_ENA    (BIT(26))
#define MCPWM_TZ2_OST_INT_ENA_M  (BIT(26))
#define MCPWM_TZ2_OST_INT_ENA_V  0x1
#define MCPWM_TZ2_OST_INT_ENA_S  26
/* MCPWM_TZ1_OST_INT_ENA : R/W ;bitpos:[25] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ1_OST_INT_ENA    (BIT(25))
#define MCPWM_TZ1_OST_INT_ENA_M  (BIT(25))
#define MCPWM_TZ1_OST_INT_ENA_V  0x1
#define MCPWM_TZ1_OST_INT_ENA_S  25
/* MCPWM_TZ0_OST_INT_ENA : R/W ;bitpos:[24] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ0_OST_INT_ENA    (BIT(24))
#define MCPWM_TZ0_OST_INT_ENA_M  (BIT(24))
#define MCPWM_TZ0_OST_INT_ENA_V  0x1
#define MCPWM_TZ0_OST_INT_ENA_S  24
/* MCPWM_TZ2_CBC_INT_ENA : R/W ;bitpos:[23] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ2_CBC_INT_ENA    (BIT(23))
#define MCPWM_TZ2_CBC_INT_ENA_M  (BIT(23))
#define MCPWM_TZ2_CBC_INT_ENA_V  0x1
#define MCPWM_TZ2_CBC_INT_ENA_S  23
/* MCPWM_TZ1_CBC_INT_ENA : R/W ;bitpos:[22] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ1_CBC_INT_ENA    (BIT(22))
#define MCPWM_TZ1_CBC_INT_ENA_M  (BIT(22))
#define MCPWM_TZ1_CBC_INT_ENA_V  0x1
#define MCPWM_TZ1_CBC_INT_ENA_S  22
/* MCPWM_TZ0_CBC_INT_ENA : R/W ;bitpos:[21] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ0_CBC_INT_ENA    (BIT(21))
#define MCPWM_TZ0_CBC_INT_ENA_M  (BIT(21))
#define MCPWM_TZ0_CBC_INT_ENA_V  0x1
#define MCPWM_TZ0_CBC_INT_ENA_S  21
/* MCPWM_CMPR2_TEB_INT_ENA : R/W ;bitpos:[20] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR2_TEB_INT_ENA    (BIT(20))
#define MCPWM_CMPR2_TEB_INT_ENA_M  (BIT(20))
#define MCPWM_CMPR2_TEB_INT_ENA_V  0x1
#define MCPWM_CMPR2_TEB_INT_ENA_S  20
/* MCPWM_CMPR1_TEB_INT_ENA : R/W ;bitpos:[19] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR1_TEB_INT_ENA    (BIT(19))
#define MCPWM_CMPR1_TEB_INT_ENA_M  (BIT(19))
#define MCPWM_CMPR1_TEB_INT_ENA_V  0x1
#define MCPWM_CMPR1_TEB_INT_ENA_S  19
/* MCPWM_CMPR0_TEB_INT_ENA : R/W ;bitpos:[18] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR0_TEB_INT_ENA    (BIT(18))
#define MCPWM_CMPR0_TEB_INT_ENA_M  (BIT(18))
#define MCPWM_CMPR0_TEB_INT_ENA_V  0x1
#define MCPWM_CMPR0_TEB_INT_ENA_S  18
/* MCPWM_CMPR2_TEA_INT_ENA : R/W ;bitpos:[17] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR2_TEA_INT_ENA    (BIT(17))
#define MCPWM_CMPR2_TEA_INT_ENA_M  (BIT(17))
#define MCPWM_CMPR2_TEA_INT_ENA_V  0x1
#define MCPWM_CMPR2_TEA_INT_ENA_S  17
/* MCPWM_CMPR1_TEA_INT_ENA : R/W ;bitpos:[16] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR1_TEA_INT_ENA    (BIT(16))
#define MCPWM_CMPR1_TEA_INT_ENA_M  (BIT(16))
#define MCPWM_CMPR1_TEA_INT_ENA_V  0x1
#define MCPWM_CMPR1_TEA_INT_ENA_S  16
/* MCPWM_CMPR0_TEA_INT_ENA : R/W ;bitpos:[15] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR0_TEA_INT_ENA    (BIT(15))
#define MCPWM_CMPR0_TEA_INT_ENA_M  (BIT(15))
#define MCPWM_CMPR0_TEA_INT_ENA_V  0x1
#define MCPWM_CMPR0_TEA_INT_ENA_S  15
/* MCPWM_FAULT2_CLR_INT_ENA : R/W ;bitpos:[14] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT2_CLR_INT_ENA    (BIT(14))
#define MCPWM_FAULT2_CLR_INT_ENA_M  (BIT(14))
#define MCPWM_FAULT2_CLR_INT_ENA_V  0x1
#define MCPWM_FAULT2_CLR_INT_ENA_S  14
/* MCPWM_FAULT1_CLR_INT_ENA : R/W ;bitpos:[13] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT1_CLR_INT_ENA    (BIT(13))
#define MCPWM_FAULT1_CLR_INT_ENA_M  (BIT(13))
#define MCPWM_FAULT1_CLR_INT_ENA_V  0x1
#define MCPWM_FAULT1_CLR_INT_ENA_S  13
/* MCPWM_FAULT0_CLR_INT_ENA : R/W ;bitpos:[12] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT0_CLR_INT_ENA    (BIT(12))
#define MCPWM_FAULT0_CLR_INT_ENA_M  (BIT(12))
#define MCPWM_FAULT0_CLR_INT_ENA_V  0x1
#define MCPWM_FAULT0_CLR_INT_ENA_S  12
/* MCPWM_FAULT2_INT_ENA : R/W ;bitpos:[11] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT2_INT_ENA    (BIT(11))
#define MCPWM_FAULT2_INT_ENA_M  (BIT(11))
#define MCPWM_FAULT2_INT_ENA_V  0x1
#define MCPWM_FAULT2_INT_ENA_S  11
/* MCPWM_FAULT1_INT_ENA : R/W ;bitpos:[10] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT1_INT_ENA    (BIT(10))
#define MCPWM_FAULT1_INT_ENA_M  (BIT(10))
#define MCPWM_FAULT1_INT_ENA_V  0x1
#define MCPWM_FAULT1_INT_ENA_S  10
/* MCPWM_FAULT0_INT_ENA : R/W ;bitpos:[9] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT0_INT_ENA    (BIT(9))
#define MCPWM_FAULT0_INT_ENA_M  (BIT(9))
#define MCPWM_FAULT0_INT_ENA_V  0x1
#define MCPWM_FAULT0_INT_ENA_S  9
/* MCPWM_TIMER2_TEP_INT_ENA : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER2_TEP_INT_ENA    (BIT(8))
#define MCPWM_TIMER2_TEP_INT_ENA_M  (BIT(8))
#define MCPWM_TIMER2_TEP_INT_ENA_V  0x1
#define MCPWM_TIMER2_TEP_INT_ENA_S  8
/* MCPWM_TIMER1_TEP_INT_ENA : R/W ;bitpos:[7] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER1_TEP_INT_ENA    (BIT(7))
#define MCPWM_TIMER1_TEP_INT_ENA_M  (BIT(7))
#define MCPWM_TIMER1_TEP_INT_ENA_V  0x1
#define MCPWM_TIMER1_TEP_INT_ENA_S  7
/* MCPWM_TIMER0_TEP_INT_ENA : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER0_TEP_INT_ENA    (BIT(6))
#define MCPWM_TIMER0_TEP_INT_ENA_M  (BIT(6))
#define MCPWM_TIMER0_TEP_INT_ENA_V  0x1
#define MCPWM_TIMER0_TEP_INT_ENA_S  6
/* MCPWM_TIMER2_TEZ_INT_ENA : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER2_TEZ_INT_ENA    (BIT(5))
#define MCPWM_TIMER2_TEZ_INT_ENA_M  (BIT(5))
#define MCPWM_TIMER2_TEZ_INT_ENA_V  0x1
#define MCPWM_TIMER2_TEZ_INT_ENA_S  5
/* MCPWM_TIMER1_TEZ_INT_ENA : R/W ;bitpos:[4] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER1_TEZ_INT_ENA    (BIT(4))
#define MCPWM_TIMER1_TEZ_INT_ENA_M  (BIT(4))
#define MCPWM_TIMER1_TEZ_INT_ENA_V  0x1
#define MCPWM_TIMER1_TEZ_INT_ENA_S  4
/* MCPWM_TIMER0_TEZ_INT_ENA : R/W ;bitpos:[3] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER0_TEZ_INT_ENA    (BIT(3))
#define MCPWM_TIMER0_TEZ_INT_ENA_M  (BIT(3))
#define MCPWM_TIMER0_TEZ_INT_ENA_V  0x1
#define MCPWM_TIMER0_TEZ_INT_ENA_S  3
/* MCPWM_TIMER2_STOP_INT_ENA : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER2_STOP_INT_ENA    (BIT(2))
#define MCPWM_TIMER2_STOP_INT_ENA_M  (BIT(2))
#define MCPWM_TIMER2_STOP_INT_ENA_V  0x1
#define MCPWM_TIMER2_STOP_INT_ENA_S  2
/* MCPWM_TIMER1_STOP_INT_ENA : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER1_STOP_INT_ENA    (BIT(1))
#define MCPWM_TIMER1_STOP_INT_ENA_M  (BIT(1))
#define MCPWM_TIMER1_STOP_INT_ENA_V  0x1
#define MCPWM_TIMER1_STOP_INT_ENA_S  1
/* MCPWM_TIMER0_STOP_INT_ENA : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER0_STOP_INT_ENA    (BIT(0))
#define MCPWM_TIMER0_STOP_INT_ENA_M  (BIT(0))
#define MCPWM_TIMER0_STOP_INT_ENA_V  0x1
#define MCPWM_TIMER0_STOP_INT_ENA_S  0

#define MCPWM_INT_RAW_PWM_REG(i)          (REG_MCPWM_BASE(i) + 0x114)
/* MCPWM_CAP2_INT_RAW : RO ;bitpos:[29] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP2_INT_RAW    (BIT(29))
#define MCPWM_CAP2_INT_RAW_M  (BIT(29))
#define MCPWM_CAP2_INT_RAW_V  0x1
#define MCPWM_CAP2_INT_RAW_S  29
/* MCPWM_CAP1_INT_RAW : RO ;bitpos:[28] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP1_INT_RAW    (BIT(28))
#define MCPWM_CAP1_INT_RAW_M  (BIT(28))
#define MCPWM_CAP1_INT_RAW_V  0x1
#define MCPWM_CAP1_INT_RAW_S  28
/* MCPWM_CAP0_INT_RAW : RO ;bitpos:[27] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP0_INT_RAW    (BIT(27))
#define MCPWM_CAP0_INT_RAW_M  (BIT(27))
#define MCPWM_CAP0_INT_RAW_V  0x1
#define MCPWM_CAP0_INT_RAW_S  27
/* MCPWM_TZ2_OST_INT_RAW : RO ;bitpos:[26] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ2_OST_INT_RAW    (BIT(26))
#define MCPWM_TZ2_OST_INT_RAW_M  (BIT(26))
#define MCPWM_TZ2_OST_INT_RAW_V  0x1
#define MCPWM_TZ2_OST_INT_RAW_S  26
/* MCPWM_TZ1_OST_INT_RAW : RO ;bitpos:[25] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ1_OST_INT_RAW    (BIT(25))
#define MCPWM_TZ1_OST_INT_RAW_M  (BIT(25))
#define MCPWM_TZ1_OST_INT_RAW_V  0x1
#define MCPWM_TZ1_OST_INT_RAW_S  25
/* MCPWM_TZ0_OST_INT_RAW : RO ;bitpos:[24] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ0_OST_INT_RAW    (BIT(24))
#define MCPWM_TZ0_OST_INT_RAW_M  (BIT(24))
#define MCPWM_TZ0_OST_INT_RAW_V  0x1
#define MCPWM_TZ0_OST_INT_RAW_S  24
/* MCPWM_TZ2_CBC_INT_RAW : RO ;bitpos:[23] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ2_CBC_INT_RAW    (BIT(23))
#define MCPWM_TZ2_CBC_INT_RAW_M  (BIT(23))
#define MCPWM_TZ2_CBC_INT_RAW_V  0x1
#define MCPWM_TZ2_CBC_INT_RAW_S  23
/* MCPWM_TZ1_CBC_INT_RAW : RO ;bitpos:[22] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ1_CBC_INT_RAW    (BIT(22))
#define MCPWM_TZ1_CBC_INT_RAW_M  (BIT(22))
#define MCPWM_TZ1_CBC_INT_RAW_V  0x1
#define MCPWM_TZ1_CBC_INT_RAW_S  22
/* MCPWM_TZ0_CBC_INT_RAW : RO ;bitpos:[21] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ0_CBC_INT_RAW    (BIT(21))
#define MCPWM_TZ0_CBC_INT_RAW_M  (BIT(21))
#define MCPWM_TZ0_CBC_INT_RAW_V  0x1
#define MCPWM_TZ0_CBC_INT_RAW_S  21
/* MCPWM_CMPR2_TEB_INT_RAW : RO ;bitpos:[20] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR2_TEB_INT_RAW    (BIT(20))
#define MCPWM_CMPR2_TEB_INT_RAW_M  (BIT(20))
#define MCPWM_CMPR2_TEB_INT_RAW_V  0x1
#define MCPWM_CMPR2_TEB_INT_RAW_S  20
/* MCPWM_CMPR1_TEB_INT_RAW : RO ;bitpos:[19] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR1_TEB_INT_RAW    (BIT(19))
#define MCPWM_CMPR1_TEB_INT_RAW_M  (BIT(19))
#define MCPWM_CMPR1_TEB_INT_RAW_V  0x1
#define MCPWM_CMPR1_TEB_INT_RAW_S  19
/* MCPWM_CMPR0_TEB_INT_RAW : RO ;bitpos:[18] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR0_TEB_INT_RAW    (BIT(18))
#define MCPWM_CMPR0_TEB_INT_RAW_M  (BIT(18))
#define MCPWM_CMPR0_TEB_INT_RAW_V  0x1
#define MCPWM_CMPR0_TEB_INT_RAW_S  18
/* MCPWM_CMPR2_TEA_INT_RAW : RO ;bitpos:[17] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR2_TEA_INT_RAW    (BIT(17))
#define MCPWM_CMPR2_TEA_INT_RAW_M  (BIT(17))
#define MCPWM_CMPR2_TEA_INT_RAW_V  0x1
#define MCPWM_CMPR2_TEA_INT_RAW_S  17
/* MCPWM_CMPR1_TEA_INT_RAW : RO ;bitpos:[16] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR1_TEA_INT_RAW    (BIT(16))
#define MCPWM_CMPR1_TEA_INT_RAW_M  (BIT(16))
#define MCPWM_CMPR1_TEA_INT_RAW_V  0x1
#define MCPWM_CMPR1_TEA_INT_RAW_S  16
/* MCPWM_CMPR0_TEA_INT_RAW : RO ;bitpos:[15] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR0_TEA_INT_RAW    (BIT(15))
#define MCPWM_CMPR0_TEA_INT_RAW_M  (BIT(15))
#define MCPWM_CMPR0_TEA_INT_RAW_V  0x1
#define MCPWM_CMPR0_TEA_INT_RAW_S  15
/* MCPWM_FAULT2_CLR_INT_RAW : RO ;bitpos:[14] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT2_CLR_INT_RAW    (BIT(14))
#define MCPWM_FAULT2_CLR_INT_RAW_M  (BIT(14))
#define MCPWM_FAULT2_CLR_INT_RAW_V  0x1
#define MCPWM_FAULT2_CLR_INT_RAW_S  14
/* MCPWM_FAULT1_CLR_INT_RAW : RO ;bitpos:[13] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT1_CLR_INT_RAW    (BIT(13))
#define MCPWM_FAULT1_CLR_INT_RAW_M  (BIT(13))
#define MCPWM_FAULT1_CLR_INT_RAW_V  0x1
#define MCPWM_FAULT1_CLR_INT_RAW_S  13
/* MCPWM_FAULT0_CLR_INT_RAW : RO ;bitpos:[12] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT0_CLR_INT_RAW    (BIT(12))
#define MCPWM_FAULT0_CLR_INT_RAW_M  (BIT(12))
#define MCPWM_FAULT0_CLR_INT_RAW_V  0x1
#define MCPWM_FAULT0_CLR_INT_RAW_S  12
/* MCPWM_FAULT2_INT_RAW : RO ;bitpos:[11] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT2_INT_RAW    (BIT(11))
#define MCPWM_FAULT2_INT_RAW_M  (BIT(11))
#define MCPWM_FAULT2_INT_RAW_V  0x1
#define MCPWM_FAULT2_INT_RAW_S  11
/* MCPWM_FAULT1_INT_RAW : RO ;bitpos:[10] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT1_INT_RAW    (BIT(10))
#define MCPWM_FAULT1_INT_RAW_M  (BIT(10))
#define MCPWM_FAULT1_INT_RAW_V  0x1
#define MCPWM_FAULT1_INT_RAW_S  10
/* MCPWM_FAULT0_INT_RAW : RO ;bitpos:[9] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT0_INT_RAW    (BIT(9))
#define MCPWM_FAULT0_INT_RAW_M  (BIT(9))
#define MCPWM_FAULT0_INT_RAW_V  0x1
#define MCPWM_FAULT0_INT_RAW_S  9
/* MCPWM_TIMER2_TEP_INT_RAW : RO ;bitpos:[8] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER2_TEP_INT_RAW    (BIT(8))
#define MCPWM_TIMER2_TEP_INT_RAW_M  (BIT(8))
#define MCPWM_TIMER2_TEP_INT_RAW_V  0x1
#define MCPWM_TIMER2_TEP_INT_RAW_S  8
/* MCPWM_TIMER1_TEP_INT_RAW : RO ;bitpos:[7] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER1_TEP_INT_RAW    (BIT(7))
#define MCPWM_TIMER1_TEP_INT_RAW_M  (BIT(7))
#define MCPWM_TIMER1_TEP_INT_RAW_V  0x1
#define MCPWM_TIMER1_TEP_INT_RAW_S  7
/* MCPWM_TIMER0_TEP_INT_RAW : RO ;bitpos:[6] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER0_TEP_INT_RAW    (BIT(6))
#define MCPWM_TIMER0_TEP_INT_RAW_M  (BIT(6))
#define MCPWM_TIMER0_TEP_INT_RAW_V  0x1
#define MCPWM_TIMER0_TEP_INT_RAW_S  6
/* MCPWM_TIMER2_TEZ_INT_RAW : RO ;bitpos:[5] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER2_TEZ_INT_RAW    (BIT(5))
#define MCPWM_TIMER2_TEZ_INT_RAW_M  (BIT(5))
#define MCPWM_TIMER2_TEZ_INT_RAW_V  0x1
#define MCPWM_TIMER2_TEZ_INT_RAW_S  5
/* MCPWM_TIMER1_TEZ_INT_RAW : RO ;bitpos:[4] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER1_TEZ_INT_RAW    (BIT(4))
#define MCPWM_TIMER1_TEZ_INT_RAW_M  (BIT(4))
#define MCPWM_TIMER1_TEZ_INT_RAW_V  0x1
#define MCPWM_TIMER1_TEZ_INT_RAW_S  4
/* MCPWM_TIMER0_TEZ_INT_RAW : RO ;bitpos:[3] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER0_TEZ_INT_RAW    (BIT(3))
#define MCPWM_TIMER0_TEZ_INT_RAW_M  (BIT(3))
#define MCPWM_TIMER0_TEZ_INT_RAW_V  0x1
#define MCPWM_TIMER0_TEZ_INT_RAW_S  3
/* MCPWM_TIMER2_STOP_INT_RAW : RO ;bitpos:[2] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER2_STOP_INT_RAW    (BIT(2))
#define MCPWM_TIMER2_STOP_INT_RAW_M  (BIT(2))
#define MCPWM_TIMER2_STOP_INT_RAW_V  0x1
#define MCPWM_TIMER2_STOP_INT_RAW_S  2
/* MCPWM_TIMER1_STOP_INT_RAW : RO ;bitpos:[1] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER1_STOP_INT_RAW    (BIT(1))
#define MCPWM_TIMER1_STOP_INT_RAW_M  (BIT(1))
#define MCPWM_TIMER1_STOP_INT_RAW_V  0x1
#define MCPWM_TIMER1_STOP_INT_RAW_S  1
/* MCPWM_TIMER0_STOP_INT_RAW : RO ;bitpos:[0] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER0_STOP_INT_RAW    (BIT(0))
#define MCPWM_TIMER0_STOP_INT_RAW_M  (BIT(0))
#define MCPWM_TIMER0_STOP_INT_RAW_V  0x1
#define MCPWM_TIMER0_STOP_INT_RAW_S  0

