espressif/esp-idf/components/soc/esp32s3/include/soc/mcpwm_reg.h
#define MCPWM_INT_ST_PWM_REG(i)          (REG_MCPWM_BASE(i) + 0x118)
/* MCPWM_CAP2_INT_ST : RO ;bitpos:[29] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP2_INT_ST    (BIT(29))
#define MCPWM_CAP2_INT_ST_M  (BIT(29))
#define MCPWM_CAP2_INT_ST_V  0x1
#define MCPWM_CAP2_INT_ST_S  29
/* MCPWM_CAP1_INT_ST : RO ;bitpos:[28] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP1_INT_ST    (BIT(28))
#define MCPWM_CAP1_INT_ST_M  (BIT(28))
#define MCPWM_CAP1_INT_ST_V  0x1
#define MCPWM_CAP1_INT_ST_S  28
/* MCPWM_CAP0_INT_ST : RO ;bitpos:[27] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CAP0_INT_ST    (BIT(27))
#define MCPWM_CAP0_INT_ST_M  (BIT(27))
#define MCPWM_CAP0_INT_ST_V  0x1
#define MCPWM_CAP0_INT_ST_S  27
/* MCPWM_TZ2_OST_INT_ST : RO ;bitpos:[26] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ2_OST_INT_ST    (BIT(26))
#define MCPWM_TZ2_OST_INT_ST_M  (BIT(26))
#define MCPWM_TZ2_OST_INT_ST_V  0x1
#define MCPWM_TZ2_OST_INT_ST_S  26
/* MCPWM_TZ1_OST_INT_ST : RO ;bitpos:[25] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ1_OST_INT_ST    (BIT(25))
#define MCPWM_TZ1_OST_INT_ST_M  (BIT(25))
#define MCPWM_TZ1_OST_INT_ST_V  0x1
#define MCPWM_TZ1_OST_INT_ST_S  25
/* MCPWM_TZ0_OST_INT_ST : RO ;bitpos:[24] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ0_OST_INT_ST    (BIT(24))
#define MCPWM_TZ0_OST_INT_ST_M  (BIT(24))
#define MCPWM_TZ0_OST_INT_ST_V  0x1
#define MCPWM_TZ0_OST_INT_ST_S  24
/* MCPWM_TZ2_CBC_INT_ST : RO ;bitpos:[23] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ2_CBC_INT_ST    (BIT(23))
#define MCPWM_TZ2_CBC_INT_ST_M  (BIT(23))
#define MCPWM_TZ2_CBC_INT_ST_V  0x1
#define MCPWM_TZ2_CBC_INT_ST_S  23
/* MCPWM_TZ1_CBC_INT_ST : RO ;bitpos:[22] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ1_CBC_INT_ST    (BIT(22))
#define MCPWM_TZ1_CBC_INT_ST_M  (BIT(22))
#define MCPWM_TZ1_CBC_INT_ST_V  0x1
#define MCPWM_TZ1_CBC_INT_ST_S  22
/* MCPWM_TZ0_CBC_INT_ST : RO ;bitpos:[21] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_TZ0_CBC_INT_ST    (BIT(21))
#define MCPWM_TZ0_CBC_INT_ST_M  (BIT(21))
#define MCPWM_TZ0_CBC_INT_ST_V  0x1
#define MCPWM_TZ0_CBC_INT_ST_S  21
/* MCPWM_CMPR2_TEB_INT_ST : RO ;bitpos:[20] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR2_TEB_INT_ST    (BIT(20))
#define MCPWM_CMPR2_TEB_INT_ST_M  (BIT(20))
#define MCPWM_CMPR2_TEB_INT_ST_V  0x1
#define MCPWM_CMPR2_TEB_INT_ST_S  20
/* MCPWM_CMPR1_TEB_INT_ST : RO ;bitpos:[19] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR1_TEB_INT_ST    (BIT(19))
#define MCPWM_CMPR1_TEB_INT_ST_M  (BIT(19))
#define MCPWM_CMPR1_TEB_INT_ST_V  0x1
#define MCPWM_CMPR1_TEB_INT_ST_S  19
/* MCPWM_CMPR0_TEB_INT_ST : RO ;bitpos:[18] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR0_TEB_INT_ST    (BIT(18))
#define MCPWM_CMPR0_TEB_INT_ST_M  (BIT(18))
#define MCPWM_CMPR0_TEB_INT_ST_V  0x1
#define MCPWM_CMPR0_TEB_INT_ST_S  18
/* MCPWM_CMPR2_TEA_INT_ST : RO ;bitpos:[17] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR2_TEA_INT_ST    (BIT(17))
#define MCPWM_CMPR2_TEA_INT_ST_M  (BIT(17))
#define MCPWM_CMPR2_TEA_INT_ST_V  0x1
#define MCPWM_CMPR2_TEA_INT_ST_S  17
/* MCPWM_CMPR1_TEA_INT_ST : RO ;bitpos:[16] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR1_TEA_INT_ST    (BIT(16))
#define MCPWM_CMPR1_TEA_INT_ST_M  (BIT(16))
#define MCPWM_CMPR1_TEA_INT_ST_V  0x1
#define MCPWM_CMPR1_TEA_INT_ST_S  16
/* MCPWM_CMPR0_TEA_INT_ST : RO ;bitpos:[15] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_CMPR0_TEA_INT_ST    (BIT(15))
#define MCPWM_CMPR0_TEA_INT_ST_M  (BIT(15))
#define MCPWM_CMPR0_TEA_INT_ST_V  0x1
#define MCPWM_CMPR0_TEA_INT_ST_S  15
/* MCPWM_FAULT2_CLR_INT_ST : RO ;bitpos:[14] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT2_CLR_INT_ST    (BIT(14))
#define MCPWM_FAULT2_CLR_INT_ST_M  (BIT(14))
#define MCPWM_FAULT2_CLR_INT_ST_V  0x1
#define MCPWM_FAULT2_CLR_INT_ST_S  14
/* MCPWM_FAULT1_CLR_INT_ST : RO ;bitpos:[13] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT1_CLR_INT_ST    (BIT(13))
#define MCPWM_FAULT1_CLR_INT_ST_M  (BIT(13))
#define MCPWM_FAULT1_CLR_INT_ST_V  0x1
#define MCPWM_FAULT1_CLR_INT_ST_S  13
/* MCPWM_FAULT0_CLR_INT_ST : RO ;bitpos:[12] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT0_CLR_INT_ST    (BIT(12))
#define MCPWM_FAULT0_CLR_INT_ST_M  (BIT(12))
#define MCPWM_FAULT0_CLR_INT_ST_V  0x1
#define MCPWM_FAULT0_CLR_INT_ST_S  12
/* MCPWM_FAULT2_INT_ST : RO ;bitpos:[11] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT2_INT_ST    (BIT(11))
#define MCPWM_FAULT2_INT_ST_M  (BIT(11))
#define MCPWM_FAULT2_INT_ST_V  0x1
#define MCPWM_FAULT2_INT_ST_S  11
/* MCPWM_FAULT1_INT_ST : RO ;bitpos:[10] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT1_INT_ST    (BIT(10))
#define MCPWM_FAULT1_INT_ST_M  (BIT(10))
#define MCPWM_FAULT1_INT_ST_V  0x1
#define MCPWM_FAULT1_INT_ST_S  10
/* MCPWM_FAULT0_INT_ST : RO ;bitpos:[9] ;default: 1'd0 ; */
/*description: .*/
#define MCPWM_FAULT0_INT_ST    (BIT(9))
#define MCPWM_FAULT0_INT_ST_M  (BIT(9))
#define MCPWM_FAULT0_INT_ST_V  0x1
#define MCPWM_FAULT0_INT_ST_S  9
/* MCPWM_TIMER2_TEP_INT_ST : RO ;bitpos:[8] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER2_TEP_INT_ST    (BIT(8))
#define MCPWM_TIMER2_TEP_INT_ST_M  (BIT(8))
#define MCPWM_TIMER2_TEP_INT_ST_V  0x1
#define MCPWM_TIMER2_TEP_INT_ST_S  8
/* MCPWM_TIMER1_TEP_INT_ST : RO ;bitpos:[7] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER1_TEP_INT_ST    (BIT(7))
#define MCPWM_TIMER1_TEP_INT_ST_M  (BIT(7))
#define MCPWM_TIMER1_TEP_INT_ST_V  0x1
#define MCPWM_TIMER1_TEP_INT_ST_S  7
/* MCPWM_TIMER0_TEP_INT_ST : RO ;bitpos:[6] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER0_TEP_INT_ST    (BIT(6))
#define MCPWM_TIMER0_TEP_INT_ST_M  (BIT(6))
#define MCPWM_TIMER0_TEP_INT_ST_V  0x1
#define MCPWM_TIMER0_TEP_INT_ST_S  6
/* MCPWM_TIMER2_TEZ_INT_ST : RO ;bitpos:[5] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER2_TEZ_INT_ST    (BIT(5))
#define MCPWM_TIMER2_TEZ_INT_ST_M  (BIT(5))
#define MCPWM_TIMER2_TEZ_INT_ST_V  0x1
#define MCPWM_TIMER2_TEZ_INT_ST_S  5
/* MCPWM_TIMER1_TEZ_INT_ST : RO ;bitpos:[4] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER1_TEZ_INT_ST    (BIT(4))
#define MCPWM_TIMER1_TEZ_INT_ST_M  (BIT(4))
#define MCPWM_TIMER1_TEZ_INT_ST_V  0x1
#define MCPWM_TIMER1_TEZ_INT_ST_S  4
/* MCPWM_TIMER0_TEZ_INT_ST : RO ;bitpos:[3] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER0_TEZ_INT_ST    (BIT(3))
#define MCPWM_TIMER0_TEZ_INT_ST_M  (BIT(3))
#define MCPWM_TIMER0_TEZ_INT_ST_V  0x1
#define MCPWM_TIMER0_TEZ_INT_ST_S  3
/* MCPWM_TIMER2_STOP_INT_ST : RO ;bitpos:[2] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER2_STOP_INT_ST    (BIT(2))
#define MCPWM_TIMER2_STOP_INT_ST_M  (BIT(2))
#define MCPWM_TIMER2_STOP_INT_ST_V  0x1
#define MCPWM_TIMER2_STOP_INT_ST_S  2
/* MCPWM_TIMER1_STOP_INT_ST : RO ;bitpos:[1] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER1_STOP_INT_ST    (BIT(1))
#define MCPWM_TIMER1_STOP_INT_ST_M  (BIT(1))
#define MCPWM_TIMER1_STOP_INT_ST_V  0x1
#define MCPWM_TIMER1_STOP_INT_ST_S  1
/* MCPWM_TIMER0_STOP_INT_ST : RO ;bitpos:[0] ;default: 1'h0 ; */
/*description: .*/
#define MCPWM_TIMER0_STOP_INT_ST    (BIT(0))
#define MCPWM_TIMER0_STOP_INT_ST_M  (BIT(0))
#define MCPWM_TIMER0_STOP_INT_ST_V  0x1
#define MCPWM_TIMER0_STOP_INT_ST_S  0

